{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "include_colab_link": true
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/felix-thiago/EP2_Ciencia_de_dados/blob/main/EP2_Ciencia_de_Dados.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "import os\n",
        "!pip install neo4j\n",
        "from neo4j import GraphDatabase\n",
        "import json\n",
        "import requests\n",
        "import re\n",
        "\n",
        "\n",
        "senha = \"w3NXsLlWKIny0lJ_DCVGCBrB7B-YvZQEbsr_PeM59Jk\"\n",
        "url = \"neo4j+s://dd7a4afa.databases.neo4j.io\"\n",
        "usuario = \"neo4j\""
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "n6tc1IEuzmOK",
        "outputId": "6fe4b74f-285c-4a96-99dd-ef68d181ef03"
      },
      "execution_count": 97,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Requirement already satisfied: neo4j in /usr/local/lib/python3.10/dist-packages (5.26.0)\n",
            "Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2024.2)\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "class PokemonGraph:\n",
        "    def __init__(self, uri, user, password):\n",
        "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
        "\n",
        "    def close(self):\n",
        "        self.driver.close()\n",
        "\n",
        "    def clear_database(self):\n",
        "        query = \"MATCH (n) DETACH DELETE n\"\n",
        "        with self.driver.session() as session:\n",
        "            session.run(query)\n",
        "\n",
        "    @staticmethod\n",
        "    def _clear_data(tx):\n",
        "        # Apagar todos os Pokémon, tipos, habilidades e evoluções\n",
        "        tx.run(\"MATCH (n) DETACH DELETE n\")\n",
        "        print(\"Banco de dados limpo!\")\n",
        "\n",
        "    def create_pokemon(self, pokemon_id, name, weight, height):\n",
        "        with self.driver.session() as session:\n",
        "            session.execute_write(self._create_pokemon, pokemon_id, name, weight, height)\n",
        "\n",
        "    @staticmethod\n",
        "    def _create_pokemon(tx, pokemon_id, name, weight, height):\n",
        "        tx.run(\n",
        "            \"CREATE (p:Pokemon {id: $pokemon_id, name: $name, weight: $weight, height: $height})\",\n",
        "            pokemon_id=pokemon_id, name=name, weight=weight, height=height\n",
        "        )\n",
        "\n",
        "    def create_type(self, name):\n",
        "        with self.driver.session() as session:\n",
        "            session.execute_write(self._create_type, name)\n",
        "\n",
        "    @staticmethod\n",
        "    def _create_type(tx, name):\n",
        "        tx.run(\"CREATE (t:Type {name: $name})\", name=name)\n",
        "\n",
        "    def create_relation(self, pokemon_name, type_name):\n",
        "        with self.driver.session() as session:\n",
        "            session.execute_write(self._create_relation, pokemon_name, type_name)\n",
        "\n",
        "    @staticmethod\n",
        "    def _create_relation(tx, pokemon_name, type_name):\n",
        "        tx.run(\"\"\"\n",
        "            MATCH (p:Pokemon {name: $pokemon_name})\n",
        "            MATCH (t:Type {name: $type_name})\n",
        "            CREATE (p)-[:HAS_TYPE]->(t)\n",
        "            \"\"\", pokemon_name=pokemon_name, type_name=type_name)\n",
        "\n",
        "    def create_evolution_relation(self, pokemon_name, evolution_name):\n",
        "        with self.driver.session() as session:\n",
        "            session.execute_write(self._create_evolution_relation, pokemon_name, evolution_name)\n",
        "\n",
        "    @staticmethod\n",
        "    def _create_evolution_relation(tx, pokemon_name, evolution_name):\n",
        "        tx.run(\"\"\"\n",
        "            MATCH (p:Pokemon {name: $pokemon_name})\n",
        "            MATCH (e:Pokemon {name: $evolution_name})\n",
        "            CREATE (p)-[:EVOLVES_INTO]->(e)\n",
        "            \"\"\", pokemon_name=pokemon_name, evolution_name=evolution_name)\n",
        "\n",
        "    def create_ability(self, ability_name, ability_url):\n",
        "        with self.driver.session() as session:\n",
        "            session.execute_write(self._create_ability, ability_name, ability_url)\n",
        "\n",
        "    @staticmethod\n",
        "    def _create_ability(tx, ability_name, ability_url):\n",
        "        tx.run(\"CREATE (a:Ability {name: $ability_name, url: $ability_url})\",\n",
        "               ability_name=ability_name, ability_url=ability_url)\n",
        "\n",
        "    def create_ability_relation(self, pokemon_name, ability_name):\n",
        "        with self.driver.session() as session:\n",
        "            session.execute_write(self._create_ability_relation, pokemon_name, ability_name)\n",
        "\n",
        "    @staticmethod\n",
        "    def _create_ability_relation(tx, pokemon_name, ability_name):\n",
        "        tx.run(\"\"\"\n",
        "            MATCH (p:Pokemon {name: $pokemon_name})\n",
        "            MATCH (a:Ability {name: $ability_name})\n",
        "            CREATE (p)-[:HAS_ABILITY]->(a)\n",
        "            \"\"\", pokemon_name=pokemon_name, ability_name=ability_name)\n",
        "\n",
        "# Agora vamos usar o código de inserção com os dados\n",
        "uri = \"neo4j+s://dd7a4afa.databases.neo4j.io\"  # Substitua pela URL do seu banco\n",
        "user = \"neo4j\"\n",
        "password = \"w3NXsLlWKIny0lJ_DCVGCBrB7B-YvZQEbsr_PeM59Jk\"  # Sua senha do Neo4j\n",
        "\n",
        "graph = PokemonGraph(uri, user, password)\n",
        "\n",
        "# Limpar o banco de dados antes de inserir novos dados\n",
        "graph.clear_database()\n",
        "\n",
        "# Baixar o JSON\n",
        "url = 'https://raw.githubusercontent.com/felix-thiago/EP01_Ciencia-de-Dados_Senac/refs/heads/main/pokemons.json'\n",
        "headers = {'Accept': 'application/json'}\n",
        "response = requests.get(url)\n",
        "\n",
        "if response.status_code == 200:\n",
        "    data = response.json()\n",
        "    print(\"Arquivo JSON carregado com sucesso!\")\n",
        "else:\n",
        "    print(f\"Erro ao acessar a URL: {response.status_code}\")\n",
        "\n",
        "def normalize_id(pokemon_id):\n",
        "    # Converte o ID para string, remove caracteres não numéricos e converte de volta para inteiro\n",
        "    if isinstance(pokemon_id, str):\n",
        "        return str(int(re.sub(r'[^\\d]', '', pokemon_id)))\n",
        "    return pokemon_id  # Se já for numérico, retorna como está\n",
        "\n",
        "# Normalizar os IDs de cada Pokémon\n",
        "for pokemon in data:\n",
        "    pokemon['pokemon_id'] = normalize_id(pokemon['pokemon_id'])\n",
        "\n",
        "# Exibir os dados com IDs normalizados\n",
        "for pokemon in data:\n",
        "    print(f\"ID: {pokemon['pokemon_id']}, Name: {pokemon['pokemon_name']}, Weight: {pokemon['pokemon_weight']}, Height: {pokemon['pokemon_height']}\")\n",
        "\n",
        "\n",
        "\n",
        "#____________________________________________________________________________________________________________________\n",
        "\n",
        "# Função para verificar se o Pokémon já existe\n",
        "def pokemon_exists(pokemon_name):\n",
        "    query = f'MATCH (p:Pokemon {{name: \"{pokemon_name}\"}}) RETURN p LIMIT 1'\n",
        "    with graph.driver.session() as session:\n",
        "        # Usar a transação de leitura para buscar o Pokémon\n",
        "        result = session.read_transaction(lambda tx: tx.run(query).data())\n",
        "        return bool(result)  # Retorna True se encontrar o Pokémon\n",
        "\n",
        "\n",
        "def create_pokemon(self, pokemon_id, name, weight, height):\n",
        "    query = (\n",
        "        \"MERGE (p:Pokemon {id: $pokemon_id}) \"\n",
        "        \"ON CREATE SET p.name = $name, p.weight = $weight, p.height = $height\"\n",
        "    )\n",
        "    with self.driver.session() as session:\n",
        "        session.run(query, pokemon_id=pokemon_id, name=name, weight=weight, height=height)\n",
        "\n",
        "\n",
        "# Formatar o ID como uma string sem zeros à esquerda\n",
        "pokemon_id = str(int(pokemon['pokemon_id']))\n",
        "\n",
        "\n",
        "# Inserir os dados no Neo4j\n",
        "for pokemon in data:\n",
        "    pokemon_id = str(int(pokemon['pokemon_id'])).lstrip('#')  # Remover o '#' do ID\n",
        "    pokemon_name = pokemon['pokemon_name']\n",
        "    pokemon_weight = pokemon[\"pokemon_weight\"]\n",
        "    pokemon_height = pokemon[\"pokemon_height\"]\n",
        "    next_evolutions = pokemon[\"next_evolutions\"]\n",
        "    pokemon_types = pokemon[\"pokemon_types\"]\n",
        "    pokemon_abilities = pokemon.get(\"abilities\", [])  # Usar .get() para evitar KeyError\n",
        "\n",
        "    # Verificar se o Pokémon já existe, se não, criar o nó\n",
        "    if not pokemon_exists(pokemon_name):\n",
        "        graph.create_pokemon(pokemon_id, pokemon_name, pokemon_weight, pokemon_height)\n",
        "\n",
        "    # Criar tipos e relações\n",
        "    for poke_type in pokemon['pokemon_types']:\n",
        "        graph.create_type(poke_type)\n",
        "        graph.create_relation(pokemon_name, poke_type)\n",
        "\n",
        "    # Criar relações de evolução (se aplicável)\n",
        "    for evolution in pokemon['next_evolutions']:\n",
        "        evolution_name = evolution['evo_name']\n",
        "        evolution_id = str(evolution['evo_num']).lstrip('#')  # Remover o '#' do ID da evolução\n",
        "\"\"\"\n",
        "        # Verificar se o Pokémon de evolução já existe, se não, criar o nó (mas com valores fictícios)\n",
        "        if not pokemon_exists(evolution_name):\n",
        "            graph.create_pokemon(evolution_id, evolution_name, 0, 0)  # Dados de evolução, com valores fictícios\n",
        "        graph.create_evolution_relation(pokemon_name, evolution_name)\n",
        "\"\"\"\n",
        "# Criar habilidades e relações com o Pokémon\n",
        "for ability in pokemon_abilities:\n",
        "    graph.create_ability(ability)  # Criar o nó para habilidade\n",
        "    graph.create_ability_relation(pokemon_name, ability)  # Criar a relação entre Pokémon e habilidade\n",
        "\n",
        "# Fechar a conexão após o uso\n",
        "graph.close()\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "RiX15L-yHGO0",
        "outputId": "5d3a0271-83e5-4b31-d3bc-c3ca1e3fda5c"
      },
      "execution_count": 112,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Arquivo JSON carregado com sucesso!\n",
            "ID: 1, Name: Bulbasaur, Weight: 6.9 kg, Height: 0.7 m\n",
            "ID: 2, Name: Ivysaur, Weight: 13.0 kg, Height: 1.0 m\n",
            "ID: 3, Name: Venusaur, Weight: 100.0 kg, Height: 2.0 m\n",
            "ID: 4, Name: Charmander, Weight: 8.5 kg, Height: 0.6 m\n",
            "ID: 5, Name: Charmeleon, Weight: 19.0 kg, Height: 1.1 m\n",
            "ID: 6, Name: Charizard, Weight: 90.5 kg, Height: 1.7 m\n",
            "ID: 7, Name: Squirtle, Weight: 9.0 kg, Height: 0.5 m\n",
            "ID: 8, Name: Wartortle, Weight: 22.5 kg, Height: 1.0 m\n",
            "ID: 9, Name: Blastoise, Weight: 85.5 kg, Height: 1.6 m\n",
            "ID: 10, Name: Caterpie, Weight: 2.9 kg, Height: 0.3 m\n",
            "ID: 11, Name: Metapod, Weight: 9.9 kg, Height: 0.7 m\n",
            "ID: 12, Name: Butterfree, Weight: 32.0 kg, Height: 1.1 m\n",
            "ID: 13, Name: Weedle, Weight: 3.2 kg, Height: 0.3 m\n",
            "ID: 14, Name: Kakuna, Weight: 10.0 kg, Height: 0.6 m\n",
            "ID: 15, Name: Beedrill, Weight: 29.5 kg, Height: 1.0 m\n",
            "ID: 16, Name: Pidgey, Weight: 1.8 kg, Height: 0.3 m\n",
            "ID: 17, Name: Pidgeotto, Weight: 30.0 kg, Height: 1.1 m\n",
            "ID: 18, Name: Pidgeot, Weight: 39.5 kg, Height: 1.5 m\n",
            "ID: 19, Name: Rattata, Weight: 3.5 kg, Height: 0.3 m\n",
            "ID: 20, Name: Raticate, Weight: 18.5 kg, Height: 0.7 m\n",
            "ID: 21, Name: Spearow, Weight: 2.0 kg, Height: 0.3 m\n",
            "ID: 22, Name: Fearow, Weight: 38.0 kg, Height: 1.2 m\n",
            "ID: 23, Name: Ekans, Weight: 6.9 kg, Height: 2.0 m\n",
            "ID: 24, Name: Arbok, Weight: 65.0 kg, Height: 3.5 m\n",
            "ID: 25, Name: Pikachu, Weight: 6.0 kg, Height: 0.4 m\n",
            "ID: 26, Name: Raichu, Weight: 30.0 kg, Height: 0.8 m\n",
            "ID: 27, Name: Sandshrew, Weight: 12.0 kg, Height: 0.6 m\n",
            "ID: 28, Name: Sandslash, Weight: 29.5 kg, Height: 1.0 m\n",
            "ID: 29, Name: Nidoran♀ (female), Weight: 7.0 kg, Height: 0.4 m\n",
            "ID: 30, Name: Nidorina, Weight: 20.0 kg, Height: 0.8 m\n",
            "ID: 31, Name: Nidoqueen, Weight: 60.0 kg, Height: 1.3 m\n",
            "ID: 32, Name: Nidoran♂ (male), Weight: 9.0 kg, Height: 0.5 m\n",
            "ID: 33, Name: Nidorino, Weight: 19.5 kg, Height: 0.9 m\n",
            "ID: 34, Name: Nidoking, Weight: 62.0 kg, Height: 1.4 m\n",
            "ID: 35, Name: Clefairy, Weight: 7.5 kg, Height: 0.6 m\n",
            "ID: 36, Name: Clefable, Weight: 40.0 kg, Height: 1.3 m\n",
            "ID: 37, Name: Vulpix, Weight: 9.9 kg, Height: 0.6 m\n",
            "ID: 38, Name: Ninetales, Weight: 19.9 kg, Height: 1.1 m\n",
            "ID: 39, Name: Jigglypuff, Weight: 5.5 kg, Height: 0.5 m\n",
            "ID: 40, Name: Wigglytuff, Weight: 12.0 kg, Height: 1.0 m\n",
            "ID: 41, Name: Zubat, Weight: 7.5 kg, Height: 0.8 m\n",
            "ID: 42, Name: Golbat, Weight: 55.0 kg, Height: 1.6 m\n",
            "ID: 43, Name: Oddish, Weight: 5.4 kg, Height: 0.5 m\n",
            "ID: 44, Name: Gloom, Weight: 8.6 kg, Height: 0.8 m\n",
            "ID: 45, Name: Vileplume, Weight: 18.6 kg, Height: 1.2 m\n",
            "ID: 46, Name: Paras, Weight: 5.4 kg, Height: 0.3 m\n",
            "ID: 47, Name: Parasect, Weight: 29.5 kg, Height: 1.0 m\n",
            "ID: 48, Name: Venonat, Weight: 30.0 kg, Height: 1.0 m\n",
            "ID: 49, Name: Venomoth, Weight: 12.5 kg, Height: 1.5 m\n",
            "ID: 50, Name: Diglett, Weight: 0.8 kg, Height: 0.2 m\n",
            "ID: 51, Name: Dugtrio, Weight: 33.3 kg, Height: 0.7 m\n",
            "ID: 52, Name: Meowth, Weight: 4.2 kg, Height: 0.4 m\n",
            "ID: 53, Name: Persian, Weight: 32.0 kg, Height: 1.0 m\n",
            "ID: 54, Name: Psyduck, Weight: 19.6 kg, Height: 0.8 m\n",
            "ID: 55, Name: Golduck, Weight: 76.6 kg, Height: 1.7 m\n",
            "ID: 56, Name: Mankey, Weight: 28.0 kg, Height: 0.5 m\n",
            "ID: 57, Name: Primeape, Weight: 32.0 kg, Height: 1.0 m\n",
            "ID: 58, Name: Growlithe, Weight: 19.0 kg, Height: 0.7 m\n",
            "ID: 59, Name: Arcanine, Weight: 155.0 kg, Height: 1.9 m\n",
            "ID: 60, Name: Poliwag, Weight: 12.4 kg, Height: 0.6 m\n",
            "ID: 61, Name: Poliwhirl, Weight: 20.0 kg, Height: 1.0 m\n",
            "ID: 62, Name: Poliwrath, Weight: 54.0 kg, Height: 1.3 m\n",
            "ID: 63, Name: Abra, Weight: 19.5 kg, Height: 0.9 m\n",
            "ID: 64, Name: Kadabra, Weight: 56.5 kg, Height: 1.3 m\n",
            "ID: 65, Name: Alakazam, Weight: 48.0 kg, Height: 1.5 m\n",
            "ID: 66, Name: Machop, Weight: 19.5 kg, Height: 0.8 m\n",
            "ID: 67, Name: Machoke, Weight: 70.5 kg, Height: 1.5 m\n",
            "ID: 68, Name: Machamp, Weight: 130.0 kg, Height: 1.6 m\n",
            "ID: 69, Name: Bellsprout, Weight: 4.0 kg, Height: 0.7 m\n",
            "ID: 70, Name: Weepinbell, Weight: 6.4 kg, Height: 1.0 m\n",
            "ID: 71, Name: Victreebel, Weight: 15.5 kg, Height: 1.7 m\n",
            "ID: 72, Name: Tentacool, Weight: 45.5 kg, Height: 0.9 m\n",
            "ID: 73, Name: Tentacruel, Weight: 55.0 kg, Height: 1.6 m\n",
            "ID: 74, Name: Geodude, Weight: 20.0 kg, Height: 0.4 m\n",
            "ID: 75, Name: Graveler, Weight: 105.0 kg, Height: 1.0 m\n",
            "ID: 76, Name: Golem, Weight: 300.0 kg, Height: 1.4 m\n",
            "ID: 77, Name: Ponyta, Weight: 30.0 kg, Height: 1.0 m\n",
            "ID: 78, Name: Rapidash, Weight: 95.0 kg, Height: 1.7 m\n",
            "ID: 79, Name: Slowpoke, Weight: 36.0 kg, Height: 1.2 m\n",
            "ID: 80, Name: Slowbro, Weight: 78.5 kg, Height: 1.6 m\n",
            "ID: 81, Name: Magnemite, Weight: 6.0 kg, Height: 0.3 m\n",
            "ID: 82, Name: Magneton, Weight: 60.0 kg, Height: 1.0 m\n",
            "ID: 83, Name: Farfetch'd, Weight: 15.0 kg, Height: 0.8 m\n",
            "ID: 84, Name: Doduo, Weight: 39.2 kg, Height: 1.4 m\n",
            "ID: 85, Name: Dodrio, Weight: 85.2 kg, Height: 1.8 m\n",
            "ID: 86, Name: Seel, Weight: 90.0 kg, Height: 1.1 m\n",
            "ID: 87, Name: Dewgong, Weight: 120.0 kg, Height: 1.7 m\n",
            "ID: 88, Name: Grimer, Weight: 30.0 kg, Height: 0.9 m\n",
            "ID: 89, Name: Muk, Weight: 30.0 kg, Height: 1.2 m\n",
            "ID: 90, Name: Shellder, Weight: 4.0 kg, Height: 0.3 m\n",
            "ID: 91, Name: Cloyster, Weight: 132.5 kg, Height: 1.5 m\n",
            "ID: 92, Name: Gastly, Weight: 0.1 kg, Height: 1.3 m\n",
            "ID: 93, Name: Haunter, Weight: 0.1 kg, Height: 1.6 m\n",
            "ID: 94, Name: Gengar, Weight: 40.5 kg, Height: 1.5 m\n",
            "ID: 95, Name: Onix, Weight: 210.0 kg, Height: 8.8 m\n",
            "ID: 96, Name: Drowzee, Weight: 32.4 kg, Height: 1.0 m\n",
            "ID: 97, Name: Hypno, Weight: 75.6 kg, Height: 1.6 m\n",
            "ID: 98, Name: Krabby, Weight: 6.5 kg, Height: 0.4 m\n",
            "ID: 99, Name: Kingler, Weight: 60.0 kg, Height: 1.3 m\n",
            "ID: 100, Name: Voltorb, Weight: 10.4 kg, Height: 0.5 m\n",
            "ID: 101, Name: Electrode, Weight: 66.6 kg, Height: 1.2 m\n",
            "ID: 102, Name: Exeggcute, Weight: 2.5 kg, Height: 0.4 m\n",
            "ID: 103, Name: Exeggutor, Weight: 120.0 kg, Height: 2.0 m\n",
            "ID: 104, Name: Cubone, Weight: 6.5 kg, Height: 0.4 m\n",
            "ID: 105, Name: Marowak, Weight: 45.0 kg, Height: 1.0 m\n",
            "ID: 106, Name: Hitmonlee, Weight: 49.8 kg, Height: 1.5 m\n",
            "ID: 107, Name: Hitmonchan, Weight: 50.2 kg, Height: 1.4 m\n",
            "ID: 108, Name: Lickitung, Weight: 65.5 kg, Height: 1.2 m\n",
            "ID: 109, Name: Koffing, Weight: 1.0 kg, Height: 0.6 m\n",
            "ID: 110, Name: Weezing, Weight: 9.5 kg, Height: 1.2 m\n",
            "ID: 111, Name: Rhyhorn, Weight: 115.0 kg, Height: 1.0 m\n",
            "ID: 112, Name: Rhydon, Weight: 120.0 kg, Height: 1.9 m\n",
            "ID: 113, Name: Chansey, Weight: 34.6 kg, Height: 1.1 m\n",
            "ID: 114, Name: Tangela, Weight: 35.0 kg, Height: 1.0 m\n",
            "ID: 115, Name: Kangaskhan, Weight: 80.0 kg, Height: 2.2 m\n",
            "ID: 116, Name: Horsea, Weight: 8.0 kg, Height: 0.4 m\n",
            "ID: 117, Name: Seadra, Weight: 25.0 kg, Height: 1.2 m\n",
            "ID: 118, Name: Goldeen, Weight: 15.0 kg, Height: 0.6 m\n",
            "ID: 119, Name: Seaking, Weight: 39.0 kg, Height: 1.3 m\n",
            "ID: 120, Name: Staryu, Weight: 34.5 kg, Height: 0.8 m\n",
            "ID: 121, Name: Starmie, Weight: 80.0 kg, Height: 1.1 m\n",
            "ID: 122, Name: Mr. Mime, Weight: 54.5 kg, Height: 1.3 m\n",
            "ID: 123, Name: Scyther, Weight: 56.0 kg, Height: 1.5 m\n",
            "ID: 124, Name: Jynx, Weight: 40.6 kg, Height: 1.4 m\n",
            "ID: 125, Name: Electabuzz, Weight: 30.0 kg, Height: 1.1 m\n",
            "ID: 126, Name: Magmar, Weight: 44.5 kg, Height: 1.3 m\n",
            "ID: 127, Name: Pinsir, Weight: 55.0 kg, Height: 1.5 m\n",
            "ID: 128, Name: Tauros, Weight: 88.4 kg, Height: 1.4 m\n",
            "ID: 129, Name: Magikarp, Weight: 10.0 kg, Height: 0.9 m\n",
            "ID: 130, Name: Gyarados, Weight: 235.0 kg, Height: 6.5 m\n",
            "ID: 131, Name: Lapras, Weight: 220.0 kg, Height: 2.5 m\n",
            "ID: 132, Name: Ditto, Weight: 4.0 kg, Height: 0.3 m\n",
            "ID: 133, Name: Eevee, Weight: 6.5 kg, Height: 0.3 m\n",
            "ID: 134, Name: Vaporeon, Weight: 29.0 kg, Height: 1.0 m\n",
            "ID: 135, Name: Jolteon, Weight: 24.5 kg, Height: 0.8 m\n",
            "ID: 136, Name: Flareon, Weight: 25.0 kg, Height: 0.9 m\n",
            "ID: 137, Name: Porygon, Weight: 36.5 kg, Height: 0.8 m\n",
            "ID: 138, Name: Omanyte, Weight: 7.5 kg, Height: 0.4 m\n",
            "ID: 139, Name: Omastar, Weight: 35.0 kg, Height: 1.0 m\n",
            "ID: 140, Name: Kabuto, Weight: 11.5 kg, Height: 0.5 m\n",
            "ID: 141, Name: Kabutops, Weight: 40.5 kg, Height: 1.3 m\n",
            "ID: 142, Name: Aerodactyl, Weight: 59.0 kg, Height: 1.8 m\n",
            "ID: 143, Name: Snorlax, Weight: 460.0 kg, Height: 2.1 m\n",
            "ID: 144, Name: Articuno, Weight: 55.4 kg, Height: 1.7 m\n",
            "ID: 145, Name: Zapdos, Weight: 52.6 kg, Height: 1.6 m\n",
            "ID: 146, Name: Moltres, Weight: 60.0 kg, Height: 2.0 m\n",
            "ID: 147, Name: Dratini, Weight: 3.3 kg, Height: 1.8 m\n",
            "ID: 148, Name: Dragonair, Weight: 16.5 kg, Height: 4.0 m\n",
            "ID: 149, Name: Dragonite, Weight: 210.0 kg, Height: 2.2 m\n",
            "ID: 150, Name: Mewtwo, Weight: 122.0 kg, Height: 2.0 m\n",
            "ID: 151, Name: Mew, Weight: 4.0 kg, Height: 0.4 m\n",
            "ID: 152, Name: Chikorita, Weight: 6.4 kg, Height: 0.9 m\n",
            "ID: 153, Name: Bayleef, Weight: 15.8 kg, Height: 1.2 m\n",
            "ID: 154, Name: Meganium, Weight: 100.5 kg, Height: 1.8 m\n",
            "ID: 155, Name: Cyndaquil, Weight: 7.9 kg, Height: 0.5 m\n",
            "ID: 156, Name: Quilava, Weight: 19.0 kg, Height: 0.9 m\n",
            "ID: 157, Name: Typhlosion, Weight: 79.5 kg, Height: 1.7 m\n",
            "ID: 158, Name: Totodile, Weight: 9.5 kg, Height: 0.6 m\n",
            "ID: 159, Name: Croconaw, Weight: 25.0 kg, Height: 1.1 m\n",
            "ID: 160, Name: Feraligatr, Weight: 88.8 kg, Height: 2.3 m\n",
            "ID: 161, Name: Sentret, Weight: 6.0 kg, Height: 0.8 m\n",
            "ID: 162, Name: Furret, Weight: 32.5 kg, Height: 1.8 m\n",
            "ID: 163, Name: Hoothoot, Weight: 21.2 kg, Height: 0.7 m\n",
            "ID: 164, Name: Noctowl, Weight: 40.8 kg, Height: 1.6 m\n",
            "ID: 165, Name: Ledyba, Weight: 10.8 kg, Height: 1.0 m\n",
            "ID: 166, Name: Ledian, Weight: 35.6 kg, Height: 1.4 m\n",
            "ID: 167, Name: Spinarak, Weight: 8.5 kg, Height: 0.5 m\n",
            "ID: 168, Name: Ariados, Weight: 33.5 kg, Height: 1.1 m\n",
            "ID: 169, Name: Crobat, Weight: 75.0 kg, Height: 1.8 m\n",
            "ID: 170, Name: Chinchou, Weight: 12.0 kg, Height: 0.5 m\n",
            "ID: 171, Name: Lanturn, Weight: 22.5 kg, Height: 1.2 m\n",
            "ID: 172, Name: Pichu, Weight: 2.0 kg, Height: 0.3 m\n",
            "ID: 173, Name: Cleffa, Weight: 3.0 kg, Height: 0.3 m\n",
            "ID: 174, Name: Igglybuff, Weight: 1.0 kg, Height: 0.3 m\n",
            "ID: 175, Name: Togepi, Weight: 1.5 kg, Height: 0.3 m\n",
            "ID: 176, Name: Togetic, Weight: 3.2 kg, Height: 0.6 m\n",
            "ID: 177, Name: Natu, Weight: 2.0 kg, Height: 0.2 m\n",
            "ID: 178, Name: Xatu, Weight: 15.0 kg, Height: 1.5 m\n",
            "ID: 179, Name: Mareep, Weight: 7.8 kg, Height: 0.6 m\n",
            "ID: 180, Name: Flaaffy, Weight: 13.3 kg, Height: 0.8 m\n",
            "ID: 181, Name: Ampharos, Weight: 61.5 kg, Height: 1.4 m\n",
            "ID: 182, Name: Bellossom, Weight: 5.8 kg, Height: 0.4 m\n",
            "ID: 183, Name: Marill, Weight: 8.5 kg, Height: 0.4 m\n",
            "ID: 184, Name: Azumarill, Weight: 28.5 kg, Height: 0.8 m\n",
            "ID: 185, Name: Sudowoodo, Weight: 38.0 kg, Height: 1.2 m\n",
            "ID: 186, Name: Politoed, Weight: 33.9 kg, Height: 1.1 m\n",
            "ID: 187, Name: Hoppip, Weight: 0.5 kg, Height: 0.4 m\n",
            "ID: 188, Name: Skiploom, Weight: 1.0 kg, Height: 0.6 m\n",
            "ID: 189, Name: Jumpluff, Weight: 3.0 kg, Height: 0.8 m\n",
            "ID: 190, Name: Aipom, Weight: 11.5 kg, Height: 0.8 m\n",
            "ID: 191, Name: Sunkern, Weight: 1.8 kg, Height: 0.3 m\n",
            "ID: 192, Name: Sunflora, Weight: 8.5 kg, Height: 0.8 m\n",
            "ID: 193, Name: Yanma, Weight: 38.0 kg, Height: 1.2 m\n",
            "ID: 194, Name: Wooper, Weight: 8.5 kg, Height: 0.4 m\n",
            "ID: 195, Name: Quagsire, Weight: 75.0 kg, Height: 1.4 m\n",
            "ID: 196, Name: Espeon, Weight: 26.5 kg, Height: 0.9 m\n",
            "ID: 197, Name: Umbreon, Weight: 27.0 kg, Height: 1.0 m\n",
            "ID: 198, Name: Murkrow, Weight: 2.1 kg, Height: 0.5 m\n",
            "ID: 199, Name: Slowking, Weight: 79.5 kg, Height: 2.0 m\n",
            "ID: 200, Name: Misdreavus, Weight: 1.0 kg, Height: 0.7 m\n",
            "ID: 201, Name: Unown, Weight: 5.0 kg, Height: 0.5 m\n",
            "ID: 202, Name: Wobbuffet, Weight: 28.5 kg, Height: 1.3 m\n",
            "ID: 203, Name: Girafarig, Weight: 41.5 kg, Height: 1.5 m\n",
            "ID: 204, Name: Pineco, Weight: 7.2 kg, Height: 0.6 m\n",
            "ID: 205, Name: Forretress, Weight: 125.8 kg, Height: 1.2 m\n",
            "ID: 206, Name: Dunsparce, Weight: 14.0 kg, Height: 1.5 m\n",
            "ID: 207, Name: Gligar, Weight: 64.8 kg, Height: 1.1 m\n",
            "ID: 208, Name: Steelix, Weight: 400.0 kg, Height: 9.2 m\n",
            "ID: 209, Name: Snubbull, Weight: 7.8 kg, Height: 0.6 m\n",
            "ID: 210, Name: Granbull, Weight: 48.7 kg, Height: 1.4 m\n",
            "ID: 211, Name: Qwilfish, Weight: 3.9 kg, Height: 0.5 m\n",
            "ID: 212, Name: Scizor, Weight: 118.0 kg, Height: 1.8 m\n",
            "ID: 213, Name: Shuckle, Weight: 20.5 kg, Height: 0.6 m\n",
            "ID: 214, Name: Heracross, Weight: 54.0 kg, Height: 1.5 m\n",
            "ID: 215, Name: Sneasel, Weight: 28.0 kg, Height: 0.9 m\n",
            "ID: 216, Name: Teddiursa, Weight: 8.8 kg, Height: 0.6 m\n",
            "ID: 217, Name: Ursaring, Weight: 125.8 kg, Height: 1.8 m\n",
            "ID: 218, Name: Slugma, Weight: 35.0 kg, Height: 0.7 m\n",
            "ID: 219, Name: Magcargo, Weight: 55.0 kg, Height: 0.8 m\n",
            "ID: 220, Name: Swinub, Weight: 6.5 kg, Height: 0.4 m\n",
            "ID: 221, Name: Piloswine, Weight: 55.8 kg, Height: 1.1 m\n",
            "ID: 222, Name: Corsola, Weight: 5.0 kg, Height: 0.6 m\n",
            "ID: 223, Name: Remoraid, Weight: 12.0 kg, Height: 0.6 m\n",
            "ID: 224, Name: Octillery, Weight: 28.5 kg, Height: 0.9 m\n",
            "ID: 225, Name: Delibird, Weight: 16.0 kg, Height: 0.9 m\n",
            "ID: 226, Name: Mantine, Weight: 220.0 kg, Height: 2.1 m\n",
            "ID: 227, Name: Skarmory, Weight: 50.5 kg, Height: 1.7 m\n",
            "ID: 228, Name: Houndour, Weight: 10.8 kg, Height: 0.6 m\n",
            "ID: 229, Name: Houndoom, Weight: 35.0 kg, Height: 1.4 m\n",
            "ID: 230, Name: Kingdra, Weight: 152.0 kg, Height: 1.8 m\n",
            "ID: 231, Name: Phanpy, Weight: 33.5 kg, Height: 0.5 m\n",
            "ID: 232, Name: Donphan, Weight: 120.0 kg, Height: 1.1 m\n",
            "ID: 233, Name: Porygon2, Weight: 32.5 kg, Height: 0.6 m\n",
            "ID: 234, Name: Stantler, Weight: 71.2 kg, Height: 1.4 m\n",
            "ID: 235, Name: Smeargle, Weight: 58.0 kg, Height: 1.2 m\n",
            "ID: 236, Name: Tyrogue, Weight: 21.0 kg, Height: 0.7 m\n",
            "ID: 237, Name: Hitmontop, Weight: 48.0 kg, Height: 1.4 m\n",
            "ID: 238, Name: Smoochum, Weight: 6.0 kg, Height: 0.4 m\n",
            "ID: 239, Name: Elekid, Weight: 23.5 kg, Height: 0.6 m\n",
            "ID: 240, Name: Magby, Weight: 21.4 kg, Height: 0.7 m\n",
            "ID: 241, Name: Miltank, Weight: 75.5 kg, Height: 1.2 m\n",
            "ID: 242, Name: Blissey, Weight: 46.8 kg, Height: 1.5 m\n",
            "ID: 243, Name: Raikou, Weight: 178.0 kg, Height: 1.9 m\n",
            "ID: 244, Name: Entei, Weight: 198.0 kg, Height: 2.1 m\n",
            "ID: 245, Name: Suicune, Weight: 187.0 kg, Height: 2.0 m\n",
            "ID: 246, Name: Larvitar, Weight: 72.0 kg, Height: 0.6 m\n",
            "ID: 247, Name: Pupitar, Weight: 152.0 kg, Height: 1.2 m\n",
            "ID: 248, Name: Tyranitar, Weight: 202.0 kg, Height: 2.0 m\n",
            "ID: 249, Name: Lugia, Weight: 216.0 kg, Height: 5.2 m\n",
            "ID: 250, Name: Ho-oh, Weight: 199.0 kg, Height: 3.8 m\n",
            "ID: 251, Name: Celebi, Weight: 5.0 kg, Height: 0.6 m\n",
            "ID: 252, Name: Treecko, Weight: 5.0 kg, Height: 0.5 m\n",
            "ID: 253, Name: Grovyle, Weight: 21.6 kg, Height: 0.9 m\n",
            "ID: 254, Name: Sceptile, Weight: 52.2 kg, Height: 1.7 m\n",
            "ID: 255, Name: Torchic, Weight: 2.5 kg, Height: 0.4 m\n",
            "ID: 256, Name: Combusken, Weight: 19.5 kg, Height: 0.9 m\n",
            "ID: 257, Name: Blaziken, Weight: 52.0 kg, Height: 1.9 m\n",
            "ID: 258, Name: Mudkip, Weight: 7.6 kg, Height: 0.4 m\n",
            "ID: 259, Name: Marshtomp, Weight: 28.0 kg, Height: 0.7 m\n",
            "ID: 260, Name: Swampert, Weight: 81.9 kg, Height: 1.5 m\n",
            "ID: 261, Name: Poochyena, Weight: 13.6 kg, Height: 0.5 m\n",
            "ID: 262, Name: Mightyena, Weight: 37.0 kg, Height: 1.0 m\n",
            "ID: 263, Name: Zigzagoon, Weight: 17.5 kg, Height: 0.4 m\n",
            "ID: 264, Name: Linoone, Weight: 32.5 kg, Height: 0.5 m\n",
            "ID: 265, Name: Wurmple, Weight: 3.6 kg, Height: 0.3 m\n",
            "ID: 266, Name: Silcoon, Weight: 10.0 kg, Height: 0.6 m\n",
            "ID: 267, Name: Beautifly, Weight: 28.4 kg, Height: 1.0 m\n",
            "ID: 268, Name: Cascoon, Weight: 11.5 kg, Height: 0.7 m\n",
            "ID: 269, Name: Dustox, Weight: 31.6 kg, Height: 1.2 m\n",
            "ID: 270, Name: Lotad, Weight: 2.6 kg, Height: 0.5 m\n",
            "ID: 271, Name: Lombre, Weight: 32.5 kg, Height: 1.2 m\n",
            "ID: 272, Name: Ludicolo, Weight: 55.0 kg, Height: 1.5 m\n",
            "ID: 273, Name: Seedot, Weight: 4.0 kg, Height: 0.5 m\n",
            "ID: 274, Name: Nuzleaf, Weight: 28.0 kg, Height: 1.0 m\n",
            "ID: 275, Name: Shiftry, Weight: 59.6 kg, Height: 1.3 m\n",
            "ID: 276, Name: Taillow, Weight: 2.3 kg, Height: 0.3 m\n",
            "ID: 277, Name: Swellow, Weight: 19.8 kg, Height: 0.7 m\n",
            "ID: 278, Name: Wingull, Weight: 9.5 kg, Height: 0.6 m\n",
            "ID: 279, Name: Pelipper, Weight: 28.0 kg, Height: 1.2 m\n",
            "ID: 280, Name: Ralts, Weight: 6.6 kg, Height: 0.4 m\n",
            "ID: 281, Name: Kirlia, Weight: 20.2 kg, Height: 0.8 m\n",
            "ID: 282, Name: Gardevoir, Weight: 48.4 kg, Height: 1.6 m\n",
            "ID: 283, Name: Surskit, Weight: 1.7 kg, Height: 0.5 m\n",
            "ID: 284, Name: Masquerain, Weight: 3.6 kg, Height: 0.8 m\n",
            "ID: 285, Name: Shroomish, Weight: 4.5 kg, Height: 0.4 m\n",
            "ID: 286, Name: Breloom, Weight: 39.2 kg, Height: 1.2 m\n",
            "ID: 287, Name: Slakoth, Weight: 24.0 kg, Height: 0.8 m\n",
            "ID: 288, Name: Vigoroth, Weight: 46.5 kg, Height: 1.4 m\n",
            "ID: 289, Name: Slaking, Weight: 130.5 kg, Height: 2.0 m\n",
            "ID: 290, Name: Nincada, Weight: 5.5 kg, Height: 0.5 m\n",
            "ID: 291, Name: Ninjask, Weight: 12.0 kg, Height: 0.8 m\n",
            "ID: 292, Name: Shedinja, Weight: 1.2 kg, Height: 0.8 m\n",
            "ID: 293, Name: Whismur, Weight: 16.3 kg, Height: 0.6 m\n",
            "ID: 294, Name: Loudred, Weight: 40.5 kg, Height: 1.0 m\n",
            "ID: 295, Name: Exploud, Weight: 84.0 kg, Height: 1.5 m\n",
            "ID: 296, Name: Makuhita, Weight: 86.4 kg, Height: 1.0 m\n",
            "ID: 297, Name: Hariyama, Weight: 253.8 kg, Height: 2.3 m\n",
            "ID: 298, Name: Azurill, Weight: 2.0 kg, Height: 0.2 m\n",
            "ID: 299, Name: Nosepass, Weight: 97.0 kg, Height: 1.0 m\n",
            "ID: 300, Name: Skitty, Weight: 11.0 kg, Height: 0.6 m\n",
            "ID: 301, Name: Delcatty, Weight: 32.6 kg, Height: 1.1 m\n",
            "ID: 302, Name: Sableye, Weight: 11.0 kg, Height: 0.5 m\n",
            "ID: 303, Name: Mawile, Weight: 11.5 kg, Height: 0.6 m\n",
            "ID: 304, Name: Aron, Weight: 60.0 kg, Height: 0.4 m\n",
            "ID: 305, Name: Lairon, Weight: 120.0 kg, Height: 0.9 m\n",
            "ID: 306, Name: Aggron, Weight: 360.0 kg, Height: 2.1 m\n",
            "ID: 307, Name: Meditite, Weight: 11.2 kg, Height: 0.6 m\n",
            "ID: 308, Name: Medicham, Weight: 31.5 kg, Height: 1.3 m\n",
            "ID: 309, Name: Electrike, Weight: 15.2 kg, Height: 0.6 m\n",
            "ID: 310, Name: Manectric, Weight: 40.2 kg, Height: 1.5 m\n",
            "ID: 311, Name: Plusle, Weight: 4.2 kg, Height: 0.4 m\n",
            "ID: 312, Name: Minun, Weight: 4.2 kg, Height: 0.4 m\n",
            "ID: 313, Name: Volbeat, Weight: 17.7 kg, Height: 0.7 m\n",
            "ID: 314, Name: Illumise, Weight: 17.7 kg, Height: 0.6 m\n",
            "ID: 315, Name: Roselia, Weight: 2.0 kg, Height: 0.3 m\n",
            "ID: 316, Name: Gulpin, Weight: 10.3 kg, Height: 0.4 m\n",
            "ID: 317, Name: Swalot, Weight: 80.0 kg, Height: 1.7 m\n",
            "ID: 318, Name: Carvanha, Weight: 20.8 kg, Height: 0.8 m\n",
            "ID: 319, Name: Sharpedo, Weight: 88.8 kg, Height: 1.8 m\n",
            "ID: 320, Name: Wailmer, Weight: 130.0 kg, Height: 2.0 m\n",
            "ID: 321, Name: Wailord, Weight: 398.0 kg, Height: 14.5 m\n",
            "ID: 322, Name: Numel, Weight: 24.0 kg, Height: 0.7 m\n",
            "ID: 323, Name: Camerupt, Weight: 220.0 kg, Height: 1.9 m\n",
            "ID: 324, Name: Torkoal, Weight: 80.4 kg, Height: 0.5 m\n",
            "ID: 325, Name: Spoink, Weight: 30.6 kg, Height: 0.7 m\n",
            "ID: 326, Name: Grumpig, Weight: 71.5 kg, Height: 0.9 m\n",
            "ID: 327, Name: Spinda, Weight: 5.0 kg, Height: 1.1 m\n",
            "ID: 328, Name: Trapinch, Weight: 15.0 kg, Height: 0.7 m\n",
            "ID: 329, Name: Vibrava, Weight: 15.3 kg, Height: 1.1 m\n",
            "ID: 330, Name: Flygon, Weight: 82.0 kg, Height: 2.0 m\n",
            "ID: 331, Name: Cacnea, Weight: 51.3 kg, Height: 0.4 m\n",
            "ID: 332, Name: Cacturne, Weight: 77.4 kg, Height: 1.3 m\n",
            "ID: 333, Name: Swablu, Weight: 1.2 kg, Height: 0.4 m\n",
            "ID: 334, Name: Altaria, Weight: 20.6 kg, Height: 1.1 m\n",
            "ID: 335, Name: Zangoose, Weight: 40.3 kg, Height: 1.3 m\n",
            "ID: 336, Name: Seviper, Weight: 52.5 kg, Height: 2.7 m\n",
            "ID: 337, Name: Lunatone, Weight: 168.0 kg, Height: 1.0 m\n",
            "ID: 338, Name: Solrock, Weight: 154.0 kg, Height: 1.2 m\n",
            "ID: 339, Name: Barboach, Weight: 1.9 kg, Height: 0.4 m\n",
            "ID: 340, Name: Whiscash, Weight: 23.6 kg, Height: 0.9 m\n",
            "ID: 341, Name: Corphish, Weight: 11.5 kg, Height: 0.6 m\n",
            "ID: 342, Name: Crawdaunt, Weight: 32.8 kg, Height: 1.1 m\n",
            "ID: 343, Name: Baltoy, Weight: 21.5 kg, Height: 0.5 m\n",
            "ID: 344, Name: Claydol, Weight: 108.0 kg, Height: 1.5 m\n",
            "ID: 345, Name: Lileep, Weight: 23.8 kg, Height: 1.0 m\n",
            "ID: 346, Name: Cradily, Weight: 60.4 kg, Height: 1.5 m\n",
            "ID: 347, Name: Anorith, Weight: 12.5 kg, Height: 0.7 m\n",
            "ID: 348, Name: Armaldo, Weight: 68.2 kg, Height: 1.5 m\n",
            "ID: 349, Name: Feebas, Weight: 7.4 kg, Height: 0.6 m\n",
            "ID: 350, Name: Milotic, Weight: 162.0 kg, Height: 6.2 m\n",
            "ID: 351, Name: Castform, Weight: 0.8 kg, Height: 0.3 m\n",
            "ID: 352, Name: Kecleon, Weight: 22.0 kg, Height: 1.0 m\n",
            "ID: 353, Name: Shuppet, Weight: 2.3 kg, Height: 0.6 m\n",
            "ID: 354, Name: Banette, Weight: 12.5 kg, Height: 1.1 m\n",
            "ID: 355, Name: Duskull, Weight: 15.0 kg, Height: 0.8 m\n",
            "ID: 356, Name: Dusclops, Weight: 30.6 kg, Height: 1.6 m\n",
            "ID: 357, Name: Tropius, Weight: 100.0 kg, Height: 2.0 m\n",
            "ID: 358, Name: Chimecho, Weight: 1.0 kg, Height: 0.6 m\n",
            "ID: 359, Name: Absol, Weight: 47.0 kg, Height: 1.2 m\n",
            "ID: 360, Name: Wynaut, Weight: 14.0 kg, Height: 0.6 m\n",
            "ID: 361, Name: Snorunt, Weight: 16.8 kg, Height: 0.7 m\n",
            "ID: 362, Name: Glalie, Weight: 256.5 kg, Height: 1.5 m\n",
            "ID: 363, Name: Spheal, Weight: 39.5 kg, Height: 0.8 m\n",
            "ID: 364, Name: Sealeo, Weight: 87.6 kg, Height: 1.1 m\n",
            "ID: 365, Name: Walrein, Weight: 150.6 kg, Height: 1.4 m\n",
            "ID: 366, Name: Clamperl, Weight: 52.5 kg, Height: 0.4 m\n",
            "ID: 367, Name: Huntail, Weight: 27.0 kg, Height: 1.7 m\n",
            "ID: 368, Name: Gorebyss, Weight: 22.6 kg, Height: 1.8 m\n",
            "ID: 369, Name: Relicanth, Weight: 23.4 kg, Height: 1.0 m\n",
            "ID: 370, Name: Luvdisc, Weight: 8.7 kg, Height: 0.6 m\n",
            "ID: 371, Name: Bagon, Weight: 42.1 kg, Height: 0.6 m\n",
            "ID: 372, Name: Shelgon, Weight: 110.5 kg, Height: 1.1 m\n",
            "ID: 373, Name: Salamence, Weight: 102.6 kg, Height: 1.5 m\n",
            "ID: 374, Name: Beldum, Weight: 95.2 kg, Height: 0.6 m\n",
            "ID: 375, Name: Metang, Weight: 202.5 kg, Height: 1.2 m\n",
            "ID: 376, Name: Metagross, Weight: 550.0 kg, Height: 1.6 m\n",
            "ID: 377, Name: Regirock, Weight: 230.0 kg, Height: 1.7 m\n",
            "ID: 378, Name: Regice, Weight: 175.0 kg, Height: 1.8 m\n",
            "ID: 379, Name: Registeel, Weight: 205.0 kg, Height: 1.9 m\n",
            "ID: 380, Name: Latias, Weight: 40.0 kg, Height: 1.4 m\n",
            "ID: 381, Name: Latios, Weight: 60.0 kg, Height: 2.0 m\n",
            "ID: 382, Name: Kyogre, Weight: 352.0 kg, Height: 4.5 m\n",
            "ID: 383, Name: Groudon, Weight: 950.0 kg, Height: 3.5 m\n",
            "ID: 384, Name: Rayquaza, Weight: 206.5 kg, Height: 7.0 m\n",
            "ID: 385, Name: Jirachi, Weight: 1.1 kg, Height: 0.3 m\n",
            "ID: 386, Name: Deoxys, Weight: 60.8 kg, Height: 1.7 m\n",
            "ID: 387, Name: Turtwig, Weight: 10.2 kg, Height: 0.4 m\n",
            "ID: 388, Name: Grotle, Weight: 97.0 kg, Height: 1.1 m\n",
            "ID: 389, Name: Torterra, Weight: 310.0 kg, Height: 2.2 m\n",
            "ID: 390, Name: Chimchar, Weight: 6.2 kg, Height: 0.5 m\n",
            "ID: 391, Name: Monferno, Weight: 22.0 kg, Height: 0.9 m\n",
            "ID: 392, Name: Infernape, Weight: 55.0 kg, Height: 1.2 m\n",
            "ID: 393, Name: Piplup, Weight: 5.2 kg, Height: 0.4 m\n",
            "ID: 394, Name: Prinplup, Weight: 23.0 kg, Height: 0.8 m\n",
            "ID: 395, Name: Empoleon, Weight: 84.5 kg, Height: 1.7 m\n",
            "ID: 396, Name: Starly, Weight: 2.0 kg, Height: 0.3 m\n",
            "ID: 397, Name: Staravia, Weight: 15.5 kg, Height: 0.6 m\n",
            "ID: 398, Name: Staraptor, Weight: 24.9 kg, Height: 1.2 m\n",
            "ID: 399, Name: Bidoof, Weight: 20.0 kg, Height: 0.5 m\n",
            "ID: 400, Name: Bibarel, Weight: 31.5 kg, Height: 1.0 m\n",
            "ID: 401, Name: Kricketot, Weight: 2.2 kg, Height: 0.3 m\n",
            "ID: 402, Name: Kricketune, Weight: 25.5 kg, Height: 1.0 m\n",
            "ID: 403, Name: Shinx, Weight: 9.5 kg, Height: 0.5 m\n",
            "ID: 404, Name: Luxio, Weight: 30.5 kg, Height: 0.9 m\n",
            "ID: 405, Name: Luxray, Weight: 42.0 kg, Height: 1.4 m\n",
            "ID: 406, Name: Budew, Weight: 1.2 kg, Height: 0.2 m\n",
            "ID: 407, Name: Roserade, Weight: 14.5 kg, Height: 0.9 m\n",
            "ID: 408, Name: Cranidos, Weight: 31.5 kg, Height: 0.9 m\n",
            "ID: 409, Name: Rampardos, Weight: 102.5 kg, Height: 1.6 m\n",
            "ID: 410, Name: Shieldon, Weight: 57.0 kg, Height: 0.5 m\n",
            "ID: 411, Name: Bastiodon, Weight: 149.5 kg, Height: 1.3 m\n",
            "ID: 412, Name: Burmy, Weight: 3.4 kg, Height: 0.2 m\n",
            "ID: 413, Name: Wormadam, Weight: 6.5 kg, Height: 0.5 m\n",
            "ID: 414, Name: Mothim, Weight: 23.3 kg, Height: 0.9 m\n",
            "ID: 415, Name: Combee, Weight: 5.5 kg, Height: 0.3 m\n",
            "ID: 416, Name: Vespiquen, Weight: 38.5 kg, Height: 1.2 m\n",
            "ID: 417, Name: Pachirisu, Weight: 3.9 kg, Height: 0.4 m\n",
            "ID: 418, Name: Buizel, Weight: 29.5 kg, Height: 0.7 m\n",
            "ID: 419, Name: Floatzel, Weight: 33.5 kg, Height: 1.1 m\n",
            "ID: 420, Name: Cherubi, Weight: 3.3 kg, Height: 0.4 m\n",
            "ID: 421, Name: Cherrim, Weight: 9.3 kg, Height: 0.5 m\n",
            "ID: 422, Name: Shellos, Weight: 6.3 kg, Height: 0.3 m\n",
            "ID: 423, Name: Gastrodon, Weight: 29.9 kg, Height: 0.9 m\n",
            "ID: 424, Name: Ambipom, Weight: 20.3 kg, Height: 1.2 m\n",
            "ID: 425, Name: Drifloon, Weight: 1.2 kg, Height: 0.4 m\n",
            "ID: 426, Name: Drifblim, Weight: 15.0 kg, Height: 1.2 m\n",
            "ID: 427, Name: Buneary, Weight: 5.5 kg, Height: 0.4 m\n",
            "ID: 428, Name: Lopunny, Weight: 33.3 kg, Height: 1.2 m\n",
            "ID: 429, Name: Mismagius, Weight: 4.4 kg, Height: 0.9 m\n",
            "ID: 430, Name: Honchkrow, Weight: 27.3 kg, Height: 0.9 m\n",
            "ID: 431, Name: Glameow, Weight: 3.9 kg, Height: 0.5 m\n",
            "ID: 432, Name: Purugly, Weight: 43.8 kg, Height: 1.0 m\n",
            "ID: 433, Name: Chingling, Weight: 0.6 kg, Height: 0.2 m\n",
            "ID: 434, Name: Stunky, Weight: 19.2 kg, Height: 0.4 m\n",
            "ID: 435, Name: Skuntank, Weight: 38.0 kg, Height: 1.0 m\n",
            "ID: 436, Name: Bronzor, Weight: 60.5 kg, Height: 0.5 m\n",
            "ID: 437, Name: Bronzong, Weight: 187.0 kg, Height: 1.3 m\n",
            "ID: 438, Name: Bonsly, Weight: 15.0 kg, Height: 0.5 m\n",
            "ID: 439, Name: Mime Jr., Weight: 13.0 kg, Height: 0.6 m\n",
            "ID: 440, Name: Happiny, Weight: 24.4 kg, Height: 0.6 m\n",
            "ID: 441, Name: Chatot, Weight: 1.9 kg, Height: 0.5 m\n",
            "ID: 442, Name: Spiritomb, Weight: 108.0 kg, Height: 1.0 m\n",
            "ID: 443, Name: Gible, Weight: 20.5 kg, Height: 0.7 m\n",
            "ID: 444, Name: Gabite, Weight: 56.0 kg, Height: 1.4 m\n",
            "ID: 445, Name: Garchomp, Weight: 95.0 kg, Height: 1.9 m\n",
            "ID: 446, Name: Munchlax, Weight: 105.0 kg, Height: 0.6 m\n",
            "ID: 447, Name: Riolu, Weight: 20.2 kg, Height: 0.7 m\n",
            "ID: 448, Name: Lucario, Weight: 54.0 kg, Height: 1.2 m\n",
            "ID: 449, Name: Hippopotas, Weight: 49.5 kg, Height: 0.8 m\n",
            "ID: 450, Name: Hippowdon, Weight: 300.0 kg, Height: 2.0 m\n",
            "ID: 451, Name: Skorupi, Weight: 12.0 kg, Height: 0.8 m\n",
            "ID: 452, Name: Drapion, Weight: 61.5 kg, Height: 1.3 m\n",
            "ID: 453, Name: Croagunk, Weight: 23.0 kg, Height: 0.7 m\n",
            "ID: 454, Name: Toxicroak, Weight: 44.4 kg, Height: 1.3 m\n",
            "ID: 455, Name: Carnivine, Weight: 27.0 kg, Height: 1.4 m\n",
            "ID: 456, Name: Finneon, Weight: 7.0 kg, Height: 0.4 m\n",
            "ID: 457, Name: Lumineon, Weight: 24.0 kg, Height: 1.2 m\n",
            "ID: 458, Name: Mantyke, Weight: 65.0 kg, Height: 1.0 m\n",
            "ID: 459, Name: Snover, Weight: 50.5 kg, Height: 1.0 m\n",
            "ID: 460, Name: Abomasnow, Weight: 135.5 kg, Height: 2.2 m\n",
            "ID: 461, Name: Weavile, Weight: 34.0 kg, Height: 1.1 m\n",
            "ID: 462, Name: Magnezone, Weight: 180.0 kg, Height: 1.2 m\n",
            "ID: 463, Name: Lickilicky, Weight: 140.0 kg, Height: 1.7 m\n",
            "ID: 464, Name: Rhyperior, Weight: 282.8 kg, Height: 2.4 m\n",
            "ID: 465, Name: Tangrowth, Weight: 128.6 kg, Height: 2.0 m\n",
            "ID: 466, Name: Electivire, Weight: 138.6 kg, Height: 1.8 m\n",
            "ID: 467, Name: Magmortar, Weight: 68.0 kg, Height: 1.6 m\n",
            "ID: 468, Name: Togekiss, Weight: 38.0 kg, Height: 1.5 m\n",
            "ID: 469, Name: Yanmega, Weight: 51.5 kg, Height: 1.9 m\n",
            "ID: 470, Name: Leafeon, Weight: 25.5 kg, Height: 1.0 m\n",
            "ID: 471, Name: Glaceon, Weight: 25.9 kg, Height: 0.8 m\n",
            "ID: 472, Name: Gliscor, Weight: 42.5 kg, Height: 2.0 m\n",
            "ID: 473, Name: Mamoswine, Weight: 291.0 kg, Height: 2.5 m\n",
            "ID: 474, Name: Porygon-Z, Weight: 34.0 kg, Height: 0.9 m\n",
            "ID: 475, Name: Gallade, Weight: 52.0 kg, Height: 1.6 m\n",
            "ID: 476, Name: Probopass, Weight: 340.0 kg, Height: 1.4 m\n",
            "ID: 477, Name: Dusknoir, Weight: 106.6 kg, Height: 2.2 m\n",
            "ID: 478, Name: Froslass, Weight: 26.6 kg, Height: 1.3 m\n",
            "ID: 479, Name: Rotom, Weight: 0.3 kg, Height: 0.3 m\n",
            "ID: 480, Name: Uxie, Weight: 0.3 kg, Height: 0.3 m\n",
            "ID: 481, Name: Mesprit, Weight: 0.3 kg, Height: 0.3 m\n",
            "ID: 482, Name: Azelf, Weight: 0.3 kg, Height: 0.3 m\n",
            "ID: 483, Name: Dialga, Weight: 683.0 kg, Height: 5.4 m\n",
            "ID: 484, Name: Palkia, Weight: 336.0 kg, Height: 4.2 m\n",
            "ID: 485, Name: Heatran, Weight: 430.0 kg, Height: 1.7 m\n",
            "ID: 486, Name: Regigigas, Weight: 420.0 kg, Height: 3.7 m\n",
            "ID: 487, Name: Giratina, Weight: 750.0 kg, Height: 4.5 m\n",
            "ID: 488, Name: Cresselia, Weight: 85.6 kg, Height: 1.5 m\n",
            "ID: 489, Name: Phione, Weight: 3.1 kg, Height: 0.4 m\n",
            "ID: 490, Name: Manaphy, Weight: 1.4 kg, Height: 0.3 m\n",
            "ID: 491, Name: Darkrai, Weight: 50.5 kg, Height: 1.5 m\n",
            "ID: 492, Name: Shaymin, Weight: 2.1 kg, Height: 0.2 m\n",
            "ID: 493, Name: Arceus, Weight: 320.0 kg, Height: 3.2 m\n",
            "ID: 494, Name: Victini, Weight: 4.0 kg, Height: 0.4 m\n",
            "ID: 495, Name: Snivy, Weight: 8.1 kg, Height: 0.6 m\n",
            "ID: 496, Name: Servine, Weight: 16.0 kg, Height: 0.8 m\n",
            "ID: 497, Name: Serperior, Weight: 63.0 kg, Height: 3.3 m\n",
            "ID: 498, Name: Tepig, Weight: 9.9 kg, Height: 0.5 m\n",
            "ID: 499, Name: Pignite, Weight: 55.5 kg, Height: 1.0 m\n",
            "ID: 500, Name: Emboar, Weight: 150.0 kg, Height: 1.6 m\n",
            "ID: 501, Name: Oshawott, Weight: 5.9 kg, Height: 0.5 m\n",
            "ID: 502, Name: Dewott, Weight: 24.5 kg, Height: 0.8 m\n",
            "ID: 503, Name: Samurott, Weight: 94.6 kg, Height: 1.5 m\n",
            "ID: 504, Name: Patrat, Weight: 11.6 kg, Height: 0.5 m\n",
            "ID: 505, Name: Watchog, Weight: 27.0 kg, Height: 1.1 m\n",
            "ID: 506, Name: Lillipup, Weight: 4.1 kg, Height: 0.4 m\n",
            "ID: 507, Name: Herdier, Weight: 14.7 kg, Height: 0.9 m\n",
            "ID: 508, Name: Stoutland, Weight: 61.0 kg, Height: 1.2 m\n",
            "ID: 509, Name: Purrloin, Weight: 10.1 kg, Height: 0.4 m\n",
            "ID: 510, Name: Liepard, Weight: 37.5 kg, Height: 1.1 m\n",
            "ID: 511, Name: Pansage, Weight: 10.5 kg, Height: 0.6 m\n",
            "ID: 512, Name: Simisage, Weight: 30.5 kg, Height: 1.1 m\n",
            "ID: 513, Name: Pansear, Weight: 11.0 kg, Height: 0.6 m\n",
            "ID: 514, Name: Simisear, Weight: 28.0 kg, Height: 1.0 m\n",
            "ID: 515, Name: Panpour, Weight: 13.5 kg, Height: 0.6 m\n",
            "ID: 516, Name: Simipour, Weight: 29.0 kg, Height: 1.0 m\n",
            "ID: 517, Name: Munna, Weight: 23.3 kg, Height: 0.6 m\n",
            "ID: 518, Name: Musharna, Weight: 60.5 kg, Height: 1.1 m\n",
            "ID: 519, Name: Pidove, Weight: 2.1 kg, Height: 0.3 m\n",
            "ID: 520, Name: Tranquill, Weight: 15.0 kg, Height: 0.6 m\n",
            "ID: 521, Name: Unfezant, Weight: 29.0 kg, Height: 1.2 m\n",
            "ID: 522, Name: Blitzle, Weight: 29.8 kg, Height: 0.8 m\n",
            "ID: 523, Name: Zebstrika, Weight: 79.5 kg, Height: 1.6 m\n",
            "ID: 524, Name: Roggenrola, Weight: 18.0 kg, Height: 0.4 m\n",
            "ID: 525, Name: Boldore, Weight: 102.0 kg, Height: 0.9 m\n",
            "ID: 526, Name: Gigalith, Weight: 260.0 kg, Height: 1.7 m\n",
            "ID: 527, Name: Woobat, Weight: 2.1 kg, Height: 0.4 m\n",
            "ID: 528, Name: Swoobat, Weight: 10.5 kg, Height: 0.9 m\n",
            "ID: 529, Name: Drilbur, Weight: 8.5 kg, Height: 0.3 m\n",
            "ID: 530, Name: Excadrill, Weight: 40.4 kg, Height: 0.7 m\n",
            "ID: 531, Name: Audino, Weight: 31.0 kg, Height: 1.1 m\n",
            "ID: 532, Name: Timburr, Weight: 12.5 kg, Height: 0.6 m\n",
            "ID: 533, Name: Gurdurr, Weight: 40.0 kg, Height: 1.2 m\n",
            "ID: 534, Name: Conkeldurr, Weight: 87.0 kg, Height: 1.4 m\n",
            "ID: 535, Name: Tympole, Weight: 4.5 kg, Height: 0.5 m\n",
            "ID: 536, Name: Palpitoad, Weight: 17.0 kg, Height: 0.8 m\n",
            "ID: 537, Name: Seismitoad, Weight: 62.0 kg, Height: 1.5 m\n",
            "ID: 538, Name: Throh, Weight: 55.5 kg, Height: 1.3 m\n",
            "ID: 539, Name: Sawk, Weight: 51.0 kg, Height: 1.4 m\n",
            "ID: 540, Name: Sewaddle, Weight: 2.5 kg, Height: 0.3 m\n",
            "ID: 541, Name: Swadloon, Weight: 7.3 kg, Height: 0.5 m\n",
            "ID: 542, Name: Leavanny, Weight: 20.5 kg, Height: 1.2 m\n",
            "ID: 543, Name: Venipede, Weight: 5.3 kg, Height: 0.4 m\n",
            "ID: 544, Name: Whirlipede, Weight: 58.5 kg, Height: 1.2 m\n",
            "ID: 545, Name: Scolipede, Weight: 200.5 kg, Height: 2.5 m\n",
            "ID: 546, Name: Cottonee, Weight: 0.6 kg, Height: 0.3 m\n",
            "ID: 547, Name: Whimsicott, Weight: 6.6 kg, Height: 0.7 m\n",
            "ID: 548, Name: Petilil, Weight: 6.6 kg, Height: 0.5 m\n",
            "ID: 549, Name: Lilligant, Weight: 16.3 kg, Height: 1.1 m\n",
            "ID: 550, Name: Basculin, Weight: 18.0 kg, Height: 1.0 m\n",
            "ID: 551, Name: Sandile, Weight: 15.2 kg, Height: 0.7 m\n",
            "ID: 552, Name: Krokorok, Weight: 33.4 kg, Height: 1.0 m\n",
            "ID: 553, Name: Krookodile, Weight: 96.3 kg, Height: 1.5 m\n",
            "ID: 554, Name: Darumaka, Weight: 37.5 kg, Height: 0.6 m\n",
            "ID: 555, Name: Darmanitan, Weight: 92.9 kg, Height: 1.3 m\n",
            "ID: 556, Name: Maractus, Weight: 28.0 kg, Height: 1.0 m\n",
            "ID: 557, Name: Dwebble, Weight: 14.5 kg, Height: 0.3 m\n",
            "ID: 558, Name: Crustle, Weight: 200.0 kg, Height: 1.4 m\n",
            "ID: 559, Name: Scraggy, Weight: 11.8 kg, Height: 0.6 m\n",
            "ID: 560, Name: Scrafty, Weight: 30.0 kg, Height: 1.1 m\n",
            "ID: 561, Name: Sigilyph, Weight: 14.0 kg, Height: 1.4 m\n",
            "ID: 562, Name: Yamask, Weight: 1.5 kg, Height: 0.5 m\n",
            "ID: 563, Name: Cofagrigus, Weight: 76.5 kg, Height: 1.7 m\n",
            "ID: 564, Name: Tirtouga, Weight: 16.5 kg, Height: 0.7 m\n",
            "ID: 565, Name: Carracosta, Weight: 81.0 kg, Height: 1.2 m\n",
            "ID: 566, Name: Archen, Weight: 9.5 kg, Height: 0.5 m\n",
            "ID: 567, Name: Archeops, Weight: 32.0 kg, Height: 1.4 m\n",
            "ID: 568, Name: Trubbish, Weight: 31.0 kg, Height: 0.6 m\n",
            "ID: 569, Name: Garbodor, Weight: 107.3 kg, Height: 1.9 m\n",
            "ID: 570, Name: Zorua, Weight: 12.5 kg, Height: 0.7 m\n",
            "ID: 571, Name: Zoroark, Weight: 81.1 kg, Height: 1.6 m\n",
            "ID: 572, Name: Minccino, Weight: 5.8 kg, Height: 0.4 m\n",
            "ID: 573, Name: Cinccino, Weight: 7.5 kg, Height: 0.5 m\n",
            "ID: 574, Name: Gothita, Weight: 5.8 kg, Height: 0.4 m\n",
            "ID: 575, Name: Gothorita, Weight: 18.0 kg, Height: 0.7 m\n",
            "ID: 576, Name: Gothitelle, Weight: 44.0 kg, Height: 1.5 m\n",
            "ID: 577, Name: Solosis, Weight: 1.0 kg, Height: 0.3 m\n",
            "ID: 578, Name: Duosion, Weight: 8.0 kg, Height: 0.6 m\n",
            "ID: 579, Name: Reuniclus, Weight: 20.1 kg, Height: 1.0 m\n",
            "ID: 580, Name: Ducklett, Weight: 5.5 kg, Height: 0.5 m\n",
            "ID: 581, Name: Swanna, Weight: 24.2 kg, Height: 1.3 m\n",
            "ID: 582, Name: Vanillite, Weight: 5.7 kg, Height: 0.4 m\n",
            "ID: 583, Name: Vanillish, Weight: 41.0 kg, Height: 1.1 m\n",
            "ID: 584, Name: Vanilluxe, Weight: 57.5 kg, Height: 1.3 m\n",
            "ID: 585, Name: Deerling, Weight: 19.5 kg, Height: 0.6 m\n",
            "ID: 586, Name: Sawsbuck, Weight: 92.5 kg, Height: 1.9 m\n",
            "ID: 587, Name: Emolga, Weight: 5.0 kg, Height: 0.4 m\n",
            "ID: 588, Name: Karrablast, Weight: 5.9 kg, Height: 0.5 m\n",
            "ID: 589, Name: Escavalier, Weight: 33.0 kg, Height: 1.0 m\n",
            "ID: 590, Name: Foongus, Weight: 1.0 kg, Height: 0.2 m\n",
            "ID: 591, Name: Amoonguss, Weight: 10.5 kg, Height: 0.6 m\n",
            "ID: 592, Name: Frillish, Weight: 33.0 kg, Height: 1.2 m\n",
            "ID: 593, Name: Jellicent, Weight: 135.0 kg, Height: 2.2 m\n",
            "ID: 594, Name: Alomomola, Weight: 31.6 kg, Height: 1.2 m\n",
            "ID: 595, Name: Joltik, Weight: 0.6 kg, Height: 0.1 m\n",
            "ID: 596, Name: Galvantula, Weight: 14.3 kg, Height: 0.8 m\n",
            "ID: 597, Name: Ferroseed, Weight: 18.8 kg, Height: 0.6 m\n",
            "ID: 598, Name: Ferrothorn, Weight: 110.0 kg, Height: 1.0 m\n",
            "ID: 599, Name: Klink, Weight: 21.0 kg, Height: 0.3 m\n",
            "ID: 600, Name: Klang, Weight: 51.0 kg, Height: 0.6 m\n",
            "ID: 601, Name: Klinklang, Weight: 81.0 kg, Height: 0.6 m\n",
            "ID: 602, Name: Tynamo, Weight: 0.3 kg, Height: 0.2 m\n",
            "ID: 603, Name: Eelektrik, Weight: 22.0 kg, Height: 1.2 m\n",
            "ID: 604, Name: Eelektross, Weight: 80.5 kg, Height: 2.1 m\n",
            "ID: 605, Name: Elgyem, Weight: 9.0 kg, Height: 0.5 m\n",
            "ID: 606, Name: Beheeyem, Weight: 34.5 kg, Height: 1.0 m\n",
            "ID: 607, Name: Litwick, Weight: 3.1 kg, Height: 0.3 m\n",
            "ID: 608, Name: Lampent, Weight: 13.0 kg, Height: 0.6 m\n",
            "ID: 609, Name: Chandelure, Weight: 34.3 kg, Height: 1.0 m\n",
            "ID: 610, Name: Axew, Weight: 18.0 kg, Height: 0.6 m\n",
            "ID: 611, Name: Fraxure, Weight: 36.0 kg, Height: 1.0 m\n",
            "ID: 612, Name: Haxorus, Weight: 105.5 kg, Height: 1.8 m\n",
            "ID: 613, Name: Cubchoo, Weight: 8.5 kg, Height: 0.5 m\n",
            "ID: 614, Name: Beartic, Weight: 260.0 kg, Height: 2.6 m\n",
            "ID: 615, Name: Cryogonal, Weight: 148.0 kg, Height: 1.1 m\n",
            "ID: 616, Name: Shelmet, Weight: 7.7 kg, Height: 0.4 m\n",
            "ID: 617, Name: Accelgor, Weight: 25.3 kg, Height: 0.8 m\n",
            "ID: 618, Name: Stunfisk, Weight: 11.0 kg, Height: 0.7 m\n",
            "ID: 619, Name: Mienfoo, Weight: 20.0 kg, Height: 0.9 m\n",
            "ID: 620, Name: Mienshao, Weight: 35.5 kg, Height: 1.4 m\n",
            "ID: 621, Name: Druddigon, Weight: 139.0 kg, Height: 1.6 m\n",
            "ID: 622, Name: Golett, Weight: 92.0 kg, Height: 1.0 m\n",
            "ID: 623, Name: Golurk, Weight: 330.0 kg, Height: 2.8 m\n",
            "ID: 624, Name: Pawniard, Weight: 10.2 kg, Height: 0.5 m\n",
            "ID: 625, Name: Bisharp, Weight: 70.0 kg, Height: 1.6 m\n",
            "ID: 626, Name: Bouffalant, Weight: 94.6 kg, Height: 1.6 m\n",
            "ID: 627, Name: Rufflet, Weight: 10.5 kg, Height: 0.5 m\n",
            "ID: 628, Name: Braviary, Weight: 41.0 kg, Height: 1.5 m\n",
            "ID: 629, Name: Vullaby, Weight: 9.0 kg, Height: 0.5 m\n",
            "ID: 630, Name: Mandibuzz, Weight: 39.5 kg, Height: 1.2 m\n",
            "ID: 631, Name: Heatmor, Weight: 58.0 kg, Height: 1.4 m\n",
            "ID: 632, Name: Durant, Weight: 33.0 kg, Height: 0.3 m\n",
            "ID: 633, Name: Deino, Weight: 17.3 kg, Height: 0.8 m\n",
            "ID: 634, Name: Zweilous, Weight: 50.0 kg, Height: 1.4 m\n",
            "ID: 635, Name: Hydreigon, Weight: 160.0 kg, Height: 1.8 m\n",
            "ID: 636, Name: Larvesta, Weight: 28.8 kg, Height: 1.1 m\n",
            "ID: 637, Name: Volcarona, Weight: 46.0 kg, Height: 1.6 m\n",
            "ID: 638, Name: Cobalion, Weight: 250.0 kg, Height: 2.1 m\n",
            "ID: 639, Name: Terrakion, Weight: 260.0 kg, Height: 1.9 m\n",
            "ID: 640, Name: Virizion, Weight: 200.0 kg, Height: 2.0 m\n",
            "ID: 641, Name: Tornadus, Weight: 63.0 kg, Height: 1.5 m\n",
            "ID: 642, Name: Thundurus, Weight: 61.0 kg, Height: 1.5 m\n",
            "ID: 643, Name: Reshiram, Weight: 330.0 kg, Height: 3.2 m\n",
            "ID: 644, Name: Zekrom, Weight: 345.0 kg, Height: 2.9 m\n",
            "ID: 645, Name: Landorus, Weight: 68.0 kg, Height: 1.5 m\n",
            "ID: 646, Name: Kyurem, Weight: 325.0 kg, Height: 3.0 m\n",
            "ID: 647, Name: Keldeo, Weight: 48.5 kg, Height: 1.4 m\n",
            "ID: 648, Name: Meloetta, Weight: 6.5 kg, Height: 0.6 m\n",
            "ID: 649, Name: Genesect, Weight: 82.5 kg, Height: 1.5 m\n",
            "ID: 650, Name: Chespin, Weight: 9.0 kg, Height: 0.4 m\n",
            "ID: 651, Name: Quilladin, Weight: 29.0 kg, Height: 0.7 m\n",
            "ID: 652, Name: Chesnaught, Weight: 90.0 kg, Height: 1.6 m\n",
            "ID: 653, Name: Fennekin, Weight: 9.4 kg, Height: 0.4 m\n",
            "ID: 654, Name: Braixen, Weight: 14.5 kg, Height: 1.0 m\n",
            "ID: 655, Name: Delphox, Weight: 39.0 kg, Height: 1.5 m\n",
            "ID: 656, Name: Froakie, Weight: 7.0 kg, Height: 0.3 m\n",
            "ID: 657, Name: Frogadier, Weight: 10.9 kg, Height: 0.6 m\n",
            "ID: 658, Name: Greninja, Weight: 40.0 kg, Height: 1.5 m\n",
            "ID: 659, Name: Bunnelby, Weight: 5.0 kg, Height: 0.4 m\n",
            "ID: 660, Name: Diggersby, Weight: 42.4 kg, Height: 1.0 m\n",
            "ID: 661, Name: Fletchling, Weight: 1.7 kg, Height: 0.3 m\n",
            "ID: 662, Name: Fletchinder, Weight: 16.0 kg, Height: 0.7 m\n",
            "ID: 663, Name: Talonflame, Weight: 24.5 kg, Height: 1.2 m\n",
            "ID: 664, Name: Scatterbug, Weight: 2.5 kg, Height: 0.3 m\n",
            "ID: 665, Name: Spewpa, Weight: 8.4 kg, Height: 0.3 m\n",
            "ID: 666, Name: Vivillon, Weight: 17.0 kg, Height: 1.2 m\n",
            "ID: 667, Name: Litleo, Weight: 13.5 kg, Height: 0.6 m\n",
            "ID: 668, Name: Pyroar, Weight: 81.5 kg, Height: 1.5 m\n",
            "ID: 669, Name: Flabébé, Weight: 0.1 kg, Height: 0.1 m\n",
            "ID: 670, Name: Floette, Weight: 0.9 kg, Height: 0.2 m\n",
            "ID: 671, Name: Florges, Weight: 10.0 kg, Height: 1.1 m\n",
            "ID: 672, Name: Skiddo, Weight: 31.0 kg, Height: 0.9 m\n",
            "ID: 673, Name: Gogoat, Weight: 91.0 kg, Height: 1.7 m\n",
            "ID: 674, Name: Pancham, Weight: 8.0 kg, Height: 0.6 m\n",
            "ID: 675, Name: Pangoro, Weight: 136.0 kg, Height: 2.1 m\n",
            "ID: 676, Name: Furfrou, Weight: 28.0 kg, Height: 1.2 m\n",
            "ID: 677, Name: Espurr, Weight: 3.5 kg, Height: 0.3 m\n",
            "ID: 678, Name: Meowstic, Weight: 8.5 kg, Height: 0.6 m\n",
            "ID: 679, Name: Honedge, Weight: 2.0 kg, Height: 0.8 m\n",
            "ID: 680, Name: Doublade, Weight: 4.5 kg, Height: 0.8 m\n",
            "ID: 681, Name: Aegislash, Weight: 53.0 kg, Height: 1.7 m\n",
            "ID: 682, Name: Spritzee, Weight: 0.5 kg, Height: 0.2 m\n",
            "ID: 683, Name: Aromatisse, Weight: 15.5 kg, Height: 0.8 m\n",
            "ID: 684, Name: Swirlix, Weight: 3.5 kg, Height: 0.4 m\n",
            "ID: 685, Name: Slurpuff, Weight: 5.0 kg, Height: 0.8 m\n",
            "ID: 686, Name: Inkay, Weight: 3.5 kg, Height: 0.4 m\n",
            "ID: 687, Name: Malamar, Weight: 47.0 kg, Height: 1.5 m\n",
            "ID: 688, Name: Binacle, Weight: 31.0 kg, Height: 0.5 m\n",
            "ID: 689, Name: Barbaracle, Weight: 96.0 kg, Height: 1.3 m\n",
            "ID: 690, Name: Skrelp, Weight: 7.3 kg, Height: 0.5 m\n",
            "ID: 691, Name: Dragalge, Weight: 81.5 kg, Height: 1.8 m\n",
            "ID: 692, Name: Clauncher, Weight: 8.3 kg, Height: 0.5 m\n",
            "ID: 693, Name: Clawitzer, Weight: 35.3 kg, Height: 1.3 m\n",
            "ID: 694, Name: Helioptile, Weight: 6.0 kg, Height: 0.5 m\n",
            "ID: 695, Name: Heliolisk, Weight: 21.0 kg, Height: 1.0 m\n",
            "ID: 696, Name: Tyrunt, Weight: 26.0 kg, Height: 0.8 m\n",
            "ID: 697, Name: Tyrantrum, Weight: 270.0 kg, Height: 2.5 m\n",
            "ID: 698, Name: Amaura, Weight: 25.2 kg, Height: 1.3 m\n",
            "ID: 699, Name: Aurorus, Weight: 225.0 kg, Height: 2.7 m\n",
            "ID: 700, Name: Sylveon, Weight: 23.5 kg, Height: 1.0 m\n",
            "ID: 701, Name: Hawlucha, Weight: 21.5 kg, Height: 0.8 m\n",
            "ID: 702, Name: Dedenne, Weight: 2.2 kg, Height: 0.2 m\n",
            "ID: 703, Name: Carbink, Weight: 5.7 kg, Height: 0.3 m\n",
            "ID: 704, Name: Goomy, Weight: 2.8 kg, Height: 0.3 m\n",
            "ID: 705, Name: Sliggoo, Weight: 17.5 kg, Height: 0.8 m\n",
            "ID: 706, Name: Goodra, Weight: 150.5 kg, Height: 2.0 m\n",
            "ID: 707, Name: Klefki, Weight: 3.0 kg, Height: 0.2 m\n",
            "ID: 708, Name: Phantump, Weight: 7.0 kg, Height: 0.4 m\n",
            "ID: 709, Name: Trevenant, Weight: 71.0 kg, Height: 1.5 m\n",
            "ID: 710, Name: Pumpkaboo, Weight: 5.0 kg, Height: 0.4 m\n",
            "ID: 711, Name: Gourgeist, Weight: 12.5 kg, Height: 0.9 m\n",
            "ID: 712, Name: Bergmite, Weight: 99.5 kg, Height: 1.0 m\n",
            "ID: 713, Name: Avalugg, Weight: 505.0 kg, Height: 2.0 m\n",
            "ID: 714, Name: Noibat, Weight: 8.0 kg, Height: 0.5 m\n",
            "ID: 715, Name: Noivern, Weight: 85.0 kg, Height: 1.5 m\n",
            "ID: 716, Name: Xerneas, Weight: 215.0 kg, Height: 3.0 m\n",
            "ID: 717, Name: Yveltal, Weight: 203.0 kg, Height: 5.8 m\n",
            "ID: 718, Name: Zygarde, Weight: 305.0 kg, Height: 5.0 m\n",
            "ID: 719, Name: Diancie, Weight: 8.8 kg, Height: 0.7 m\n",
            "ID: 720, Name: Hoopa, Weight: 9.0 kg, Height: 0.5 m\n",
            "ID: 721, Name: Volcanion, Weight: 195.0 kg, Height: 1.7 m\n",
            "ID: 722, Name: Rowlet, Weight: 1.5 kg, Height: 0.3 m\n",
            "ID: 723, Name: Dartrix, Weight: 16.0 kg, Height: 0.7 m\n",
            "ID: 724, Name: Decidueye, Weight: 36.6 kg, Height: 1.6 m\n",
            "ID: 725, Name: Litten, Weight: 4.3 kg, Height: 0.4 m\n",
            "ID: 726, Name: Torracat, Weight: 25.0 kg, Height: 0.7 m\n",
            "ID: 727, Name: Incineroar, Weight: 83.0 kg, Height: 1.8 m\n",
            "ID: 728, Name: Popplio, Weight: 7.5 kg, Height: 0.4 m\n",
            "ID: 729, Name: Brionne, Weight: 17.5 kg, Height: 0.6 m\n",
            "ID: 730, Name: Primarina, Weight: 44.0 kg, Height: 1.8 m\n",
            "ID: 731, Name: Pikipek, Weight: 1.2 kg, Height: 0.3 m\n",
            "ID: 732, Name: Trumbeak, Weight: 14.8 kg, Height: 0.6 m\n",
            "ID: 733, Name: Toucannon, Weight: 26.0 kg, Height: 1.1 m\n",
            "ID: 734, Name: Yungoos, Weight: 6.0 kg, Height: 0.4 m\n",
            "ID: 735, Name: Gumshoos, Weight: 14.2 kg, Height: 0.7 m\n",
            "ID: 736, Name: Grubbin, Weight: 4.4 kg, Height: 0.4 m\n",
            "ID: 737, Name: Charjabug, Weight: 10.5 kg, Height: 0.5 m\n",
            "ID: 738, Name: Vikavolt, Weight: 45.0 kg, Height: 1.5 m\n",
            "ID: 739, Name: Crabrawler, Weight: 7.0 kg, Height: 0.6 m\n",
            "ID: 740, Name: Crabominable, Weight: 180.0 kg, Height: 1.7 m\n",
            "ID: 741, Name: Oricorio, Weight: 3.4 kg, Height: 0.6 m\n",
            "ID: 742, Name: Cutiefly, Weight: 0.2 kg, Height: 0.1 m\n",
            "ID: 743, Name: Ribombee, Weight: 0.5 kg, Height: 0.2 m\n",
            "ID: 744, Name: Rockruff, Weight: 9.2 kg, Height: 0.5 m\n",
            "ID: 745, Name: Lycanroc, Weight: 25.0 kg, Height: 0.8 m\n",
            "ID: 746, Name: Wishiwashi, Weight: 0.3 kg, Height: 0.2 m\n",
            "ID: 747, Name: Mareanie, Weight: 8.0 kg, Height: 0.4 m\n",
            "ID: 748, Name: Toxapex, Weight: 14.5 kg, Height: 0.7 m\n",
            "ID: 749, Name: Mudbray, Weight: 110.0 kg, Height: 1.0 m\n",
            "ID: 750, Name: Mudsdale, Weight: 920.0 kg, Height: 2.5 m\n",
            "ID: 751, Name: Dewpider, Weight: 4.0 kg, Height: 0.3 m\n",
            "ID: 752, Name: Araquanid, Weight: 82.0 kg, Height: 1.8 m\n",
            "ID: 753, Name: Fomantis, Weight: 1.5 kg, Height: 0.3 m\n",
            "ID: 754, Name: Lurantis, Weight: 18.5 kg, Height: 0.9 m\n",
            "ID: 755, Name: Morelull, Weight: 1.5 kg, Height: 0.2 m\n",
            "ID: 756, Name: Shiinotic, Weight: 11.5 kg, Height: 1.0 m\n",
            "ID: 757, Name: Salandit, Weight: 4.8 kg, Height: 0.6 m\n",
            "ID: 758, Name: Salazzle, Weight: 22.2 kg, Height: 1.2 m\n",
            "ID: 759, Name: Stufful, Weight: 6.8 kg, Height: 0.5 m\n",
            "ID: 760, Name: Bewear, Weight: 135.0 kg, Height: 2.1 m\n",
            "ID: 761, Name: Bounsweet, Weight: 3.2 kg, Height: 0.3 m\n",
            "ID: 762, Name: Steenee, Weight: 8.2 kg, Height: 0.7 m\n",
            "ID: 763, Name: Tsareena, Weight: 21.4 kg, Height: 1.2 m\n",
            "ID: 764, Name: Comfey, Weight: 0.3 kg, Height: 0.1 m\n",
            "ID: 765, Name: Oranguru, Weight: 76.0 kg, Height: 1.5 m\n",
            "ID: 766, Name: Passimian, Weight: 82.8 kg, Height: 2.0 m\n",
            "ID: 767, Name: Wimpod, Weight: 12.0 kg, Height: 0.5 m\n",
            "ID: 768, Name: Golisopod, Weight: 108.0 kg, Height: 2.0 m\n",
            "ID: 769, Name: Sandygast, Weight: 70.0 kg, Height: 0.5 m\n",
            "ID: 770, Name: Palossand, Weight: 250.0 kg, Height: 1.3 m\n",
            "ID: 771, Name: Pyukumuku, Weight: 1.2 kg, Height: 0.3 m\n",
            "ID: 772, Name: Type: Null, Weight: 120.5 kg, Height: 1.9 m\n",
            "ID: 773, Name: Silvally, Weight: 100.5 kg, Height: 2.3 m\n",
            "ID: 774, Name: Minior, Weight: 40.0 kg, Height: 0.3 m\n",
            "ID: 775, Name: Komala, Weight: 19.9 kg, Height: 0.4 m\n",
            "ID: 776, Name: Turtonator, Weight: 212.0 kg, Height: 2.0 m\n",
            "ID: 777, Name: Togedemaru, Weight: 3.3 kg, Height: 0.3 m\n",
            "ID: 778, Name: Mimikyu, Weight: 0.7 kg, Height: 0.2 m\n",
            "ID: 779, Name: Bruxish, Weight: 19.0 kg, Height: 0.9 m\n",
            "ID: 780, Name: Drampa, Weight: 185.0 kg, Height: 3.0 m\n",
            "ID: 781, Name: Dhelmise, Weight: 210.0 kg, Height: 3.9 m\n",
            "ID: 782, Name: Jangmo-o, Weight: 29.7 kg, Height: 0.6 m\n",
            "ID: 783, Name: Hakamo-o, Weight: 47.0 kg, Height: 1.2 m\n",
            "ID: 784, Name: Kommo-o, Weight: 78.2 kg, Height: 1.6 m\n",
            "ID: 785, Name: Tapu Koko, Weight: 20.5 kg, Height: 1.8 m\n",
            "ID: 786, Name: Tapu Lele, Weight: 18.6 kg, Height: 1.2 m\n",
            "ID: 787, Name: Tapu Bulu, Weight: 45.5 kg, Height: 1.9 m\n",
            "ID: 788, Name: Tapu Fini, Weight: 21.2 kg, Height: 1.3 m\n",
            "ID: 789, Name: Cosmog, Weight: 0.1 kg, Height: 0.2 m\n",
            "ID: 790, Name: Cosmoem, Weight: 999.9 kg, Height: 0.1 m\n",
            "ID: 791, Name: Solgaleo, Weight: 230.0 kg, Height: 3.4 m\n",
            "ID: 792, Name: Lunala, Weight: 120.0 kg, Height: 4.0 m\n",
            "ID: 793, Name: Nihilego, Weight: 55.5 kg, Height: 1.2 m\n",
            "ID: 794, Name: Buzzwole, Weight: 333.6 kg, Height: 2.4 m\n",
            "ID: 795, Name: Pheromosa, Weight: 25.0 kg, Height: 1.8 m\n",
            "ID: 796, Name: Xurkitree, Weight: 100.0 kg, Height: 3.8 m\n",
            "ID: 797, Name: Celesteela, Weight: 999.9 kg, Height: 9.2 m\n",
            "ID: 798, Name: Kartana, Weight: 0.1 kg, Height: 0.3 m\n",
            "ID: 799, Name: Guzzlord, Weight: 888.0 kg, Height: 5.5 m\n",
            "ID: 800, Name: Necrozma, Weight: 230.0 kg, Height: 2.4 m\n",
            "ID: 801, Name: Magearna, Weight: 80.5 kg, Height: 1.0 m\n",
            "ID: 802, Name: Marshadow, Weight: 22.2 kg, Height: 0.7 m\n",
            "ID: 803, Name: Poipole, Weight: 1.8 kg, Height: 0.6 m\n",
            "ID: 804, Name: Naganadel, Weight: 150.0 kg, Height: 3.6 m\n",
            "ID: 805, Name: Stakataka, Weight: 820.0 kg, Height: 5.5 m\n",
            "ID: 806, Name: Blacephalon, Weight: 13.0 kg, Height: 1.8 m\n",
            "ID: 807, Name: Zeraora, Weight: 44.5 kg, Height: 1.5 m\n",
            "ID: 808, Name: Meltan, Weight: 8.0 kg, Height: 0.2 m\n",
            "ID: 809, Name: Melmetal, Weight: 800.0 kg, Height: 2.5 m\n",
            "ID: 810, Name: Grookey, Weight: 5.0 kg, Height: 0.3 m\n",
            "ID: 811, Name: Thwackey, Weight: 14.0 kg, Height: 0.7 m\n",
            "ID: 812, Name: Rillaboom, Weight: 90.0 kg, Height: 2.1 m\n",
            "ID: 813, Name: Scorbunny, Weight: 4.5 kg, Height: 0.3 m\n",
            "ID: 814, Name: Raboot, Weight: 9.0 kg, Height: 0.6 m\n",
            "ID: 815, Name: Cinderace, Weight: 33.0 kg, Height: 1.4 m\n",
            "ID: 816, Name: Sobble, Weight: 4.0 kg, Height: 0.3 m\n",
            "ID: 817, Name: Drizzile, Weight: 11.5 kg, Height: 0.7 m\n",
            "ID: 818, Name: Inteleon, Weight: 45.2 kg, Height: 1.9 m\n",
            "ID: 819, Name: Skwovet, Weight: 2.5 kg, Height: 0.3 m\n",
            "ID: 820, Name: Greedent, Weight: 6.0 kg, Height: 0.6 m\n",
            "ID: 821, Name: Rookidee, Weight: 1.8 kg, Height: 0.2 m\n",
            "ID: 822, Name: Corvisquire, Weight: 16.0 kg, Height: 0.8 m\n",
            "ID: 823, Name: Corviknight, Weight: 75.0 kg, Height: 2.2 m\n",
            "ID: 824, Name: Blipbug, Weight: 8.0 kg, Height: 0.4 m\n",
            "ID: 825, Name: Dottler, Weight: 19.5 kg, Height: 0.4 m\n",
            "ID: 826, Name: Orbeetle, Weight: 40.8 kg, Height: 0.4 m\n",
            "ID: 827, Name: Nickit, Weight: 8.9 kg, Height: 0.6 m\n",
            "ID: 828, Name: Thievul, Weight: 19.9 kg, Height: 1.2 m\n",
            "ID: 829, Name: Gossifleur, Weight: 2.2 kg, Height: 0.4 m\n",
            "ID: 830, Name: Eldegoss, Weight: 2.5 kg, Height: 0.5 m\n",
            "ID: 831, Name: Wooloo, Weight: 6.0 kg, Height: 0.6 m\n",
            "ID: 832, Name: Dubwool, Weight: 43.0 kg, Height: 1.3 m\n",
            "ID: 833, Name: Chewtle, Weight: 8.5 kg, Height: 0.3 m\n",
            "ID: 834, Name: Drednaw, Weight: 115.5 kg, Height: 1.0 m\n",
            "ID: 835, Name: Yamper, Weight: 13.5 kg, Height: 0.3 m\n",
            "ID: 836, Name: Boltund, Weight: 34.0 kg, Height: 1.0 m\n",
            "ID: 837, Name: Rolycoly, Weight: 12.0 kg, Height: 0.3 m\n",
            "ID: 838, Name: Carkol, Weight: 78.0 kg, Height: 1.1 m\n",
            "ID: 839, Name: Coalossal, Weight: 310.5 kg, Height: 2.8 m\n",
            "ID: 840, Name: Applin, Weight: 0.5 kg, Height: 0.2 m\n",
            "ID: 841, Name: Flapple, Weight: 1.0 kg, Height: 0.3 m\n",
            "ID: 842, Name: Appletun, Weight: 13.0 kg, Height: 0.4 m\n",
            "ID: 843, Name: Silicobra, Weight: 7.6 kg, Height: 2.2 m\n",
            "ID: 844, Name: Sandaconda, Weight: 65.5 kg, Height: 3.8 m\n",
            "ID: 845, Name: Cramorant, Weight: 18.0 kg, Height: 0.8 m\n",
            "ID: 846, Name: Arrokuda, Weight: 1.0 kg, Height: 0.5 m\n",
            "ID: 847, Name: Barraskewda, Weight: 30.0 kg, Height: 1.3 m\n",
            "ID: 848, Name: Toxel, Weight: 11.0 kg, Height: 0.4 m\n",
            "ID: 849, Name: Toxtricity, Weight: 40.0 kg, Height: 1.6 m\n",
            "ID: 850, Name: Sizzlipede, Weight: 1.0 kg, Height: 0.7 m\n",
            "ID: 851, Name: Centiskorch, Weight: 120.0 kg, Height: 3.0 m\n",
            "ID: 852, Name: Clobbopus, Weight: 4.0 kg, Height: 0.6 m\n",
            "ID: 853, Name: Grapploct, Weight: 39.0 kg, Height: 1.6 m\n",
            "ID: 854, Name: Sinistea, Weight: 0.2 kg, Height: 0.1 m\n",
            "ID: 855, Name: Polteageist, Weight: 0.4 kg, Height: 0.2 m\n",
            "ID: 856, Name: Hatenna, Weight: 3.4 kg, Height: 0.4 m\n",
            "ID: 857, Name: Hattrem, Weight: 4.8 kg, Height: 0.6 m\n",
            "ID: 858, Name: Hatterene, Weight: 5.1 kg, Height: 2.1 m\n",
            "ID: 859, Name: Impidimp, Weight: 5.5 kg, Height: 0.4 m\n",
            "ID: 860, Name: Morgrem, Weight: 12.5 kg, Height: 0.8 m\n",
            "ID: 861, Name: Grimmsnarl, Weight: 61.0 kg, Height: 1.5 m\n",
            "ID: 862, Name: Obstagoon, Weight: 46.0 kg, Height: 1.6 m\n",
            "ID: 863, Name: Perrserker, Weight: 28.0 kg, Height: 0.8 m\n",
            "ID: 864, Name: Cursola, Weight: 0.4 kg, Height: 1.0 m\n",
            "ID: 865, Name: Sirfetch'd, Weight: 117.0 kg, Height: 0.8 m\n",
            "ID: 866, Name: Mr. Rime, Weight: 58.2 kg, Height: 1.5 m\n",
            "ID: 867, Name: Runerigus, Weight: 66.6 kg, Height: 1.6 m\n",
            "ID: 868, Name: Milcery, Weight: 0.3 kg, Height: 0.2 m\n",
            "ID: 869, Name: Alcremie, Weight: 0.5 kg, Height: 0.3 m\n",
            "ID: 870, Name: Falinks, Weight: 62.0 kg, Height: 3.0 m\n",
            "ID: 871, Name: Pincurchin, Weight: 1.0 kg, Height: 0.3 m\n",
            "ID: 872, Name: Snom, Weight: 3.8 kg, Height: 0.3 m\n",
            "ID: 873, Name: Frosmoth, Weight: 42.0 kg, Height: 1.3 m\n",
            "ID: 874, Name: Stonjourner, Weight: 520.0 kg, Height: 2.5 m\n",
            "ID: 875, Name: Eiscue, Weight: 89.0 kg, Height: 1.4 m\n",
            "ID: 876, Name: Indeedee, Weight: 28.0 kg, Height: 0.9 m\n",
            "ID: 877, Name: Morpeko, Weight: 3.0 kg, Height: 0.3 m\n",
            "ID: 878, Name: Cufant, Weight: 100.0 kg, Height: 1.2 m\n",
            "ID: 879, Name: Copperajah, Weight: 650.0 kg, Height: 3.0 m\n",
            "ID: 880, Name: Dracozolt, Weight: 190.0 kg, Height: 1.8 m\n",
            "ID: 881, Name: Arctozolt, Weight: 150.0 kg, Height: 2.3 m\n",
            "ID: 882, Name: Dracovish, Weight: 215.0 kg, Height: 2.3 m\n",
            "ID: 883, Name: Arctovish, Weight: 175.0 kg, Height: 2.0 m\n",
            "ID: 884, Name: Duraludon, Weight: 40.0 kg, Height: 1.8 m\n",
            "ID: 885, Name: Dreepy, Weight: 2.0 kg, Height: 0.5 m\n",
            "ID: 886, Name: Drakloak, Weight: 11.0 kg, Height: 1.4 m\n",
            "ID: 887, Name: Dragapult, Weight: 50.0 kg, Height: 3.0 m\n",
            "ID: 888, Name: Zacian, Weight: 110.0 kg, Height: 2.8 m\n",
            "ID: 889, Name: Zamazenta, Weight: 210.0 kg, Height: 2.9 m\n",
            "ID: 890, Name: Eternatus, Weight: 950.0 kg, Height: 20.0 m\n",
            "ID: 891, Name: Kubfu, Weight: 12.0 kg, Height: 0.6 m\n",
            "ID: 892, Name: Urshifu, Weight: 105.0 kg, Height: 1.9 m\n",
            "ID: 893, Name: Zarude, Weight: 70.0 kg, Height: 1.8 m\n",
            "ID: 894, Name: Regieleki, Weight: 145.0 kg, Height: 1.2 m\n",
            "ID: 895, Name: Regidrago, Weight: 200.0 kg, Height: 2.1 m\n",
            "ID: 896, Name: Glastrier, Weight: 800.0 kg, Height: 2.2 m\n",
            "ID: 897, Name: Spectrier, Weight: 44.5 kg, Height: 2.0 m\n",
            "ID: 898, Name: Calyrex, Weight: 7.7 kg, Height: 1.1 m\n",
            "ID: 899, Name: Wyrdeer, Weight: 95.1 kg, Height: 1.8 m\n",
            "ID: 900, Name: Kleavor, Weight: 89.0 kg, Height: 1.8 m\n",
            "ID: 901, Name: Ursaluna, Weight: 290.0 kg, Height: 2.4 m\n",
            "ID: 902, Name: Basculegion, Weight: 110.0 kg, Height: 3.0 m\n",
            "ID: 903, Name: Sneasler, Weight: 43.0 kg, Height: 1.3 m\n",
            "ID: 904, Name: Overqwil, Weight: 60.5 kg, Height: 2.5 m\n",
            "ID: 905, Name: Enamorus, Weight: 48.0 kg, Height: 1.6 m\n",
            "ID: 906, Name: Sprigatito, Weight: 4.1 kg, Height: 0.4 m\n",
            "ID: 907, Name: Floragato, Weight: 12.2 kg, Height: 0.9 m\n",
            "ID: 908, Name: Meowscarada, Weight: 31.2 kg, Height: 1.5 m\n",
            "ID: 909, Name: Fuecoco, Weight: 9.8 kg, Height: 0.4 m\n",
            "ID: 910, Name: Crocalor, Weight: 30.7 kg, Height: 1.0 m\n",
            "ID: 911, Name: Skeledirge, Weight: 326.5 kg, Height: 1.6 m\n",
            "ID: 912, Name: Quaxly, Weight: 6.1 kg, Height: 0.5 m\n",
            "ID: 913, Name: Quaxwell, Weight: 21.5 kg, Height: 1.2 m\n",
            "ID: 914, Name: Quaquaval, Weight: 61.9 kg, Height: 1.8 m\n",
            "ID: 915, Name: Lechonk, Weight: 10.2 kg, Height: 0.5 m\n",
            "ID: 916, Name: Oinkologne, Weight: 120.0 kg, Height: 1.0 m\n",
            "ID: 917, Name: Tarountula, Weight: 4.0 kg, Height: 0.3 m\n",
            "ID: 918, Name: Spidops, Weight: 16.5 kg, Height: 1.0 m\n",
            "ID: 919, Name: Nymble, Weight: 1.0 kg, Height: 0.2 m\n",
            "ID: 920, Name: Lokix, Weight: 17.5 kg, Height: 1.0 m\n",
            "ID: 921, Name: Pawmi, Weight: 2.5 kg, Height: 0.3 m\n",
            "ID: 922, Name: Pawmo, Weight: 6.5 kg, Height: 0.4 m\n",
            "ID: 923, Name: Pawmot, Weight: 41.0 kg, Height: 0.9 m\n",
            "ID: 924, Name: Tandemaus, Weight: 1.8 kg, Height: 0.3 m\n",
            "ID: 925, Name: Maushold, Weight: 2.8 kg, Height: 0.3 m\n",
            "ID: 926, Name: Fidough, Weight: 10.9 kg, Height: 0.3 m\n",
            "ID: 927, Name: Dachsbun, Weight: 14.9 kg, Height: 0.5 m\n",
            "ID: 928, Name: Smoliv, Weight: 6.5 kg, Height: 0.3 m\n",
            "ID: 929, Name: Dolliv, Weight: 11.9 kg, Height: 0.6 m\n",
            "ID: 930, Name: Arboliva, Weight: 48.2 kg, Height: 1.4 m\n",
            "ID: 931, Name: Squawkabilly, Weight: 2.4 kg, Height: 0.6 m\n",
            "ID: 932, Name: Nacli, Weight: 16.0 kg, Height: 0.4 m\n",
            "ID: 933, Name: Naclstack, Weight: 105.0 kg, Height: 0.6 m\n",
            "ID: 934, Name: Garganacl, Weight: 240.0 kg, Height: 2.3 m\n",
            "ID: 935, Name: Charcadet, Weight: 10.5 kg, Height: 0.6 m\n",
            "ID: 936, Name: Armarouge, Weight: 85.0 kg, Height: 1.5 m\n",
            "ID: 937, Name: Ceruledge, Weight: 62.0 kg, Height: 1.6 m\n",
            "ID: 938, Name: Tadbulb, Weight: 0.4 kg, Height: 0.3 m\n",
            "ID: 939, Name: Bellibolt, Weight: 113.0 kg, Height: 1.2 m\n",
            "ID: 940, Name: Wattrel, Weight: 3.6 kg, Height: 0.4 m\n",
            "ID: 941, Name: Kilowattrel, Weight: 38.6 kg, Height: 1.4 m\n",
            "ID: 942, Name: Maschiff, Weight: 16.0 kg, Height: 0.5 m\n",
            "ID: 943, Name: Mabosstiff, Weight: 61.0 kg, Height: 1.1 m\n",
            "ID: 944, Name: Shroodle, Weight: 0.7 kg, Height: 0.2 m\n",
            "ID: 945, Name: Grafaiai, Weight: 27.2 kg, Height: 0.7 m\n",
            "ID: 946, Name: Bramblin, Weight: 0.6 kg, Height: 0.6 m\n",
            "ID: 947, Name: Brambleghast, Weight: 6.0 kg, Height: 1.2 m\n",
            "ID: 948, Name: Toedscool, Weight: 33.0 kg, Height: 0.9 m\n",
            "ID: 949, Name: Toedscruel, Weight: 58.0 kg, Height: 1.9 m\n",
            "ID: 950, Name: Klawf, Weight: 79.0 kg, Height: 1.3 m\n",
            "ID: 951, Name: Capsakid, Weight: 3.0 kg, Height: 0.3 m\n",
            "ID: 952, Name: Scovillain, Weight: 15.0 kg, Height: 0.9 m\n",
            "ID: 953, Name: Rellor, Weight: 1.0 kg, Height: 0.2 m\n",
            "ID: 954, Name: Rabsca, Weight: 3.5 kg, Height: 0.3 m\n",
            "ID: 955, Name: Flittle, Weight: 1.5 kg, Height: 0.2 m\n",
            "ID: 956, Name: Espathra, Weight: 90.0 kg, Height: 1.9 m\n",
            "ID: 957, Name: Tinkatink, Weight: 8.9 kg, Height: 0.4 m\n",
            "ID: 958, Name: Tinkatuff, Weight: 59.1 kg, Height: 0.7 m\n",
            "ID: 959, Name: Tinkaton, Weight: 112.8 kg, Height: 0.7 m\n",
            "ID: 960, Name: Wiglett, Weight: 1.8 kg, Height: 1.2 m\n",
            "ID: 961, Name: Wugtrio, Weight: 5.4 kg, Height: 1.2 m\n",
            "ID: 962, Name: Bombirdier, Weight: 42.9 kg, Height: 1.5 m\n",
            "ID: 963, Name: Finizen, Weight: 60.2 kg, Height: 1.3 m\n",
            "ID: 964, Name: Palafin, Weight: 60.2 kg, Height: 1.3 m\n",
            "ID: 965, Name: Varoom, Weight: 35.0 kg, Height: 1.0 m\n",
            "ID: 966, Name: Revavroom, Weight: 120.0 kg, Height: 1.8 m\n",
            "ID: 967, Name: Cyclizar, Weight: 63.0 kg, Height: 1.6 m\n",
            "ID: 968, Name: Orthworm, Weight: 310.0 kg, Height: 2.5 m\n",
            "ID: 969, Name: Glimmet, Weight: 8.0 kg, Height: 0.7 m\n",
            "ID: 970, Name: Glimmora, Weight: 45.0 kg, Height: 1.5 m\n",
            "ID: 971, Name: Greavard, Weight: 35.0 kg, Height: 0.6 m\n",
            "ID: 972, Name: Houndstone, Weight: 15.0 kg, Height: 2.0 m\n",
            "ID: 973, Name: Flamigo, Weight: 37.0 kg, Height: 1.6 m\n",
            "ID: 974, Name: Cetoddle, Weight: 45.0 kg, Height: 1.2 m\n",
            "ID: 975, Name: Cetitan, Weight: 700.0 kg, Height: 4.5 m\n",
            "ID: 976, Name: Veluza, Weight: 90.0 kg, Height: 2.5 m\n",
            "ID: 977, Name: Dondozo, Weight: 220.0 kg, Height: 12.0 m\n",
            "ID: 978, Name: Tatsugiri, Weight: 8.0 kg, Height: 0.3 m\n",
            "ID: 979, Name: Annihilape, Weight: 56.0 kg, Height: 1.2 m\n",
            "ID: 980, Name: Clodsire, Weight: 223.0 kg, Height: 1.8 m\n",
            "ID: 981, Name: Farigiraf, Weight: 160.0 kg, Height: 3.2 m\n",
            "ID: 982, Name: Dudunsparce, Weight: 39.2 kg, Height: 3.6 m\n",
            "ID: 983, Name: Kingambit, Weight: 120.0 kg, Height: 2.0 m\n",
            "ID: 984, Name: Great Tusk, Weight: 320.0 kg, Height: 2.2 m\n",
            "ID: 985, Name: Scream Tail, Weight: 8.0 kg, Height: 1.2 m\n",
            "ID: 986, Name: Brute Bonnet, Weight: 21.0 kg, Height: 1.2 m\n",
            "ID: 987, Name: Flutter Mane, Weight: 4.0 kg, Height: 1.4 m\n",
            "ID: 988, Name: Slither Wing, Weight: 92.0 kg, Height: 3.2 m\n",
            "ID: 989, Name: Sandy Shocks, Weight: 60.0 kg, Height: 2.3 m\n",
            "ID: 990, Name: Iron Treads, Weight: 240.0 kg, Height: 0.9 m\n",
            "ID: 991, Name: Iron Bundle, Weight: 11.0 kg, Height: 0.6 m\n",
            "ID: 992, Name: Iron Hands, Weight: 380.7 kg, Height: 1.8 m\n",
            "ID: 993, Name: Iron Jugulis, Weight: 111.0 kg, Height: 1.3 m\n",
            "ID: 994, Name: Iron Moth, Weight: 36.0 kg, Height: 1.2 m\n",
            "ID: 995, Name: Iron Thorns, Weight: 303.0 kg, Height: 1.6 m\n",
            "ID: 996, Name: Frigibax, Weight: 17.0 kg, Height: 0.5 m\n",
            "ID: 997, Name: Arctibax, Weight: 30.0 kg, Height: 0.8 m\n",
            "ID: 998, Name: Baxcalibur, Weight: 210.0 kg, Height: 2.1 m\n",
            "ID: 999, Name: Gimmighoul, Weight: 5.0 kg, Height: 0.3 m\n",
            "ID: 1000, Name: Gholdengo, Weight: 30.0 kg, Height: 1.2 m\n",
            "ID: 1001, Name: Wo-Chien, Weight: 74.2 kg, Height: 1.5 m\n",
            "ID: 1002, Name: Chien-Pao, Weight: 152.2 kg, Height: 1.9 m\n",
            "ID: 1003, Name: Ting-Lu, Weight: 699.7 kg, Height: 2.7 m\n",
            "ID: 1004, Name: Chi-Yu, Weight: 4.9 kg, Height: 0.4 m\n",
            "ID: 1005, Name: Roaring Moon, Weight: 380.0 kg, Height: 2.0 m\n",
            "ID: 1006, Name: Iron Valiant, Weight: 35.0 kg, Height: 1.4 m\n",
            "ID: 1007, Name: Koraidon, Weight: 303.0 kg, Height: 2.5 m\n",
            "ID: 1008, Name: Miraidon, Weight: 240.0 kg, Height: 3.5 m\n",
            "ID: 1009, Name: Walking Wake, Weight: 280.0 kg, Height: 3.5 m\n",
            "ID: 1010, Name: Iron Leaves, Weight: 125.0 kg, Height: 1.5 m\n",
            "ID: 1011, Name: Dipplin, Weight: 4.4 kg, Height: 0.4 m\n",
            "ID: 1012, Name: Poltchageist, Weight: 1.1 kg, Height: 0.1 m\n",
            "ID: 1013, Name: Sinistcha, Weight: 2.2 kg, Height: 0.2 m\n",
            "ID: 1014, Name: Okidogi, Weight: 92.0 kg, Height: 1.8 m\n",
            "ID: 1015, Name: Munkidori, Weight: 12.2 kg, Height: 1.0 m\n",
            "ID: 1016, Name: Fezandipiti, Weight: 30.1 kg, Height: 1.4 m\n",
            "ID: 1017, Name: Ogerpon, Weight: 39.8 kg, Height: 1.2 m\n",
            "ID: 1018, Name: Archaludon, Weight: 60.0 kg, Height: 2.0 m\n",
            "ID: 1019, Name: Hydrapple, Weight: 93.0 kg, Height: 1.8 m\n",
            "ID: 1020, Name: Gouging Fire, Weight: 590.0 kg, Height: 3.5 m\n",
            "ID: 1021, Name: Raging Bolt, Weight: 480.0 kg, Height: 5.2 m\n",
            "ID: 1022, Name: Iron Boulder, Weight: 162.5 kg, Height: 1.5 m\n",
            "ID: 1023, Name: Iron Crown, Weight: 156.0 kg, Height: 1.6 m\n",
            "ID: 1024, Name: Terapagos, Weight: 6.5 kg, Height: 0.2 m\n",
            "ID: 1025, Name: Pecharunt, Weight: 0.3 kg, Height: 0.3 m\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "<ipython-input-112-e3543c495323>:127: DeprecationWarning: read_transaction has been renamed to execute_read\n",
            "  result = session.read_transaction(lambda tx: tx.run(query).data())\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Consultas"
      ],
      "metadata": {
        "id": "8bUoqjUe0irX"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "def pokemons_atacam_pikachu(graph):\n",
        "    query = \"\"\"\n",
        "    MATCH (p:Pokemon {name: \"Pikachu\"})-[:HAS_TYPE]->(p_type:Type)\n",
        "    MATCH (attacker:Pokemon)-[:HAS_TYPE]->(attacker_type:Type)\n",
        "    WHERE p_type.name = \"Electric\"\n",
        "      AND attacker_type.name = \"Ground\"  // Supondo que Ground é o tipo que causa mais dano ao Pikachu\n",
        "      AND attacker.weight > 10  // Pokémon com peso superior a 10kg\n",
        "    RETURN attacker.name AS Attacker, attacker.weight AS Weight\n",
        "    \"\"\"\n",
        "\n",
        "    with graph.driver.session() as session:\n",
        "        result = session.run(query)\n",
        "        return [(record[\"Attacker\"], record[\"Weight\"]) for record in result]\n",
        "\n",
        "# Chamada da função\n",
        "attacking_pokemons = pokemons_atacam_pikachu(graph)\n",
        "print(attacking_pokemons)\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "5ppjPoK99qq9",
        "outputId": "3a148f17-9d2e-47d8-b658-76e68fa8d26e"
      },
      "execution_count": 102,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "<ipython-input-102-4668fd496989>:11: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
            "  with graph.driver.session() as session:\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "[]\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "def tipo_comum_atacado_por_gelo(graph):\n",
        "    query = \"\"\"\n",
        "    MATCH (attacker:Pokemon)-[:HAS_TYPE]->(attacker_type:Type)\n",
        "    MATCH (victim:Pokemon)-[:HAS_TYPE]->(victim_type:Type)\n",
        "    WHERE attacker_type.name = \"Ice\"\n",
        "    RETURN victim_type.name AS Type, COUNT(victim_type) AS Frequency\n",
        "    ORDER BY Frequency DESC\n",
        "    LIMIT 1\n",
        "    \"\"\"\n",
        "\n",
        "    with graph.driver.session() as session:\n",
        "        result = session.run(query)\n",
        "        return result.single()\n",
        "\n",
        "# Chamada da função\n",
        "most_common_type = tipo_comum_atacado_por_gelo(graph)\n",
        "print(most_common_type)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "LFXgblQT92wX",
        "outputId": "1fb846c3-daa0-4133-8142-c0d0afeb5c22"
      },
      "execution_count": 103,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "<ipython-input-103-7274782ecdc6>:11: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
            "  with graph.driver.session() as session:\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "<Record Type='Water' Frequency=33410520>\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "def evolucoes_que_dobram_peso(graph):\n",
        "    query = \"\"\"\n",
        "    MATCH (p:Pokemon)-[:EVOLVES_INTO]->(evo1:Pokemon)-[:EVOLVES_INTO]->(evo2:Pokemon)\n",
        "    WHERE evo1.weight >= p.weight * 2  // Verifica se a primeira evolução dobrou o peso\n",
        "      OR evo2.weight >= evo1.weight * 2  // Verifica se a segunda evolução dobrou o peso\n",
        "    RETURN COUNT(p) AS EvolutionCount\n",
        "    \"\"\"\n",
        "\n",
        "    with graph.driver.session() as session:\n",
        "        result = session.run(query)\n",
        "        return result.single()\n",
        "\n",
        "# Chamada da função\n",
        "evolution_count = evolucoes_que_dobram_peso(graph)\n",
        "print(evolution_count)\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "1Jiwy1zp970o",
        "outputId": "06c9ee6f-4d0a-4909-f830-f915a37bc3b3"
      },
      "execution_count": 113,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "<ipython-input-113-2bce612afbb1>:9: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
            "  with graph.driver.session() as session:\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "<Record EvolutionCount=0>\n"
          ]
        }
      ]
    }
  ]
}